;------------------------------------------------------------------------------
;               H   H  IIIII   GGG   H   H  W   W    A    Y   Y
;               H   H    I    G   G  H   H  W   W   A A   Y   Y
;               H   H    I    G      H   H  W   W  A   A   Y Y
;               HHHHH    I    G  GG  HHHHH  W W W  A   A    Y
;               H   H    I    G   G  H   H  W W W  AAAAA    Y
;               H   H    I    G   G  H   H  W W W  A   A    Y
;               H   H  IIIII   GGG   H   H   W W   A   A    Y

;        EEEEE  N   N   CCC    OOO   U   U  N   N  TTTTT  EEEEE  RRRR
;        E      N   N  C   C  O   O  U   U  N   N    T    E      R   R
;        E      NN  N  C      O   O  U   U  NN  N    T    E      R   R
;        EEEE   N N N  C      O   O  U   U  N N N    T    EEEE   RRRR
;        E      N  NN  C      O   O  U   U  N  NN    T    E      R R
;        E      N   N  C   C  O   O  U   U  N   N    T    E      R  R
;        EEEEE  N   N   CCC    OOO    UUU   N   N    T    EEEEE  R   R

; Costa Panayi, Vortex Software, 1985
; RM-TEAM, 2014, 2015, 2016
; nzeemin 2022 порт на Вектор-06Ц
;------------------------------------------------------------------------------

;------------------------------------------------------------------------------
; data
;------------------------------------------------------------------------------

CodeGapBegin	.equ	$

		.org  (($ + 0FFH) & 0FF00H)	; align 256

CodeGapEnd	.equ	$

;------------------------------------------------------------------------------
; tabulka posunu spritu podla otocenia a rychlosti
; jeden riadok tabulky obsahuje:
; offset | velkost | vyznam
;      0 |       1 | inkrement Y pozicie spritu
;      1 |       2 | inkrement X pozicie spritu
;      3 |       1 | inkrement typu rutiny
;      4 |       2 | inkrement adresy spritu vo VO2 v ramci znakovej pozicie
;      6 |       2 | inkrement adresy spritu vo VO2 pri opusteni zn. pozicie
#define		MovSpr(incY,incX,incR,incA,incAX) .db incY
#defcont					\ .dw incX
#defcont					\ .db incR
#defcont					\ .dw incA
#defcont					\ .dw incAX
MovTable:	; rychlost 1
		MovSpr(	 0, 2, 1,      -SVO,  -(SVO-1)	) ; posun na Vychod
		MovSpr(	-1, 1, 1,         0,         1	) ; posun na Juho-Vychod
		MovSpr(	-2, 0, 1,       SVO,     SVO+1	) ; posun Juh
		MovSpr(	-1,-1, 0,       SVO,       SVO	) ; posun Juho-Zapad
		MovSpr(	 0,-2,-1,       SVO,     SVO-1	) ; posun na Zapad
		MovSpr(	 1,-1,-1,         0,        -1	) ; posun na Severo-Zapad
		MovSpr(	 2, 0,-1,      -SVO,  -(SVO+1)	) ; posun na Sever
		MovSpr(	 1, 1, 0,      -SVO,      -SVO	) ; posun na Severo-Vychod
		; rychlost 2
		MovSpr(	 0, 4, 2,       -64,       -63	) ; posun na Vychod
		MovSpr(	-2, 2, 2,         0,         1	) ; posun na Juho-Vychod
		MovSpr(	-4, 0, 2,     2*SVO,   2*SVO+1	) ; posun Juh
		MovSpr(	-2,-2, 0,     2*SVO,     2*SVO	) ; posun Juho-Zapad
		MovSpr(	 0,-4,-2,     2*SVO,   2*SVO-1	) ; posun na Zapad
		MovSpr(	 2,-2,-2,         0,        -1	) ; posun na Severo-Zapad
		MovSpr(	 4, 0,-2,       -64,       -65	) ; posun na Sever
		MovSpr(	 2, 2, 0,       -64,       -64	) ; posun na Severo-Vychod
		; rychlost 3
		MovSpr(	 0, 6, 0,       -95,       -95	) ; posun na Vychod
		MovSpr(	-3, 3, 0,         1,         1	) ; posun na Juho-Vychod
		MovSpr(	-6, 0, 0,   3*SVO+1,   3*SVO+1	) ; posun Juh
		MovSpr(	-3,-3, 0,     3*SVO,     3*SVO	) ; posun Juho-Zapad
		MovSpr(	 0,-6, 0,   3*SVO-1,   3*SVO-1	) ; posun na Zapad
		MovSpr(	 3,-3, 0,        -1,        -1	) ; posun na Severo-Zapad
		MovSpr(	 6, 0, 0,       -97,       -97	) ; posun na Sever
		MovSpr(	 3, 3, 0,       -96,       -96	) ; posun na Severo-Vychod
		; rychlost 4
		MovSpr(	 0, 8, 1,      -127,      -126	) ; posun na Vychod
		MovSpr(	-4, 4, 1,         1,         2	) ; posun na Juho-Vychod
		MovSpr(	-8, 0, 1,   4*SVO+1,   4*SVO+2	) ; posun Juh
		MovSpr(	-4,-4, 0,     4*SVO,     4*SVO	) ; posun Juho-Zapad
		MovSpr(	 0,-8,-1,   4*SVO-1,   4*SVO-2	) ; posun na Zapad
		MovSpr(	 4,-4,-1,        -1,        -2	) ; posun na Severo-Zapad
		MovSpr(	 8, 0,-1,      -129,      -130	) ; posun na Sever
		MovSpr(	 4, 4, 0,      -128,      -128	) ; posun na Severo-Vychod

;------------------------------------------------------------------------------
; Pracovne premenne
Vars:
ZoneNumber:	.db	1		; cislo zony 1 az 32
VortonStruct:	.dw	SprStructV1	; adresa struktury aktualneho Vortona
SprOffZone:	.dw	0AEAh		; offset pozicie spritov podla zony
ZonePosP:	.dw	0		; pozicia predchadzajucej zony
ZonePos:	.dw	00B0h		; pozicia aktualnej zony
ZonePosQ:	.dw	0080h		; pozicia aktualnej zony pred jej zaciatkom
SprListOrdEnd:	.dw	0		; koncova adresa zoznamu spritov
Seq0D:		.db	0		; premenna pre urcenie sekvencie spritu
Seq0E:		.db	0		; premenna pre urcenie sekvencie spritu
Seq0F:		.db	0		; premenna pre urcenie sekvencie spritu
Seq10:		.db	4		; premenna pre urcenie sekvencie spritu
Seq11:		.db	0		; premenna pre urcenie sekvencie spritu
Seq12:		.db	4		; premenna pre urcenie sekvencie spritu
Seq13:		.db	0		; premenna pre urcenie sekvencie spritu
KbdState:	.db	0		; состояние нажатия клавиш - xxxFLRUD
SndType:	.db	0		; тип звука
LTronStep:	.db	0		; pocitadlo krokov Lasertronu
VortonHead:	.db	6		; znakovy stlpec hlavy akt. Vortona na panely
PowerIndik:	.db	22		; znakovy stlpec pre aktualny dielik POWER
TimePos:	.db	(22*2)+1	; znakovy stlpec pre aktualny dielik casu
TimeDelay:	.dw	3500		; zdrzanie na jeden dielik casu
ZoneNumberT:	.db	1		; cislo zony 1 az 36
ChngSpdDly:	.db	0		; zdrzanie pri zmene rychlosti Vortona
ChngRotDly:	.db	0		; zdrzanie pri zmene otocenia Vortona
		.db	0		; cas letu 1. Strely
		.db	0		; cas letu 2. Strely
		.db	0		; cas letu 3. Strely
FireDelay:	.db	0		; zdrzanie pred dalsim vystrelom
Aborted:	.db	0		; flag - mission aborted
SprOffStep:	.db	0		; pocet krokov, ktore treba pridat pri vykreslovani spritu

VarsLen		.equ	$-Vars

; kopia premennych
BackupVars:	.db	1
		.dw	SprStructV1
		.dw	0AEAh
		.dw	0
		.dw	00B0h
		.dw	0080h
		.dw	0
		.db	0
		.db	0
		.db	0
		.db	4
		.db	0
		.db	4
		.db	0
		.db	0
		.db	0
		.db	0
		.db	6
		.db	22
		.db	(22*2)+1
		.dw	3500
		.db	1
		.db	0
		.db	0
		.db	0
		.db	0
		.db	0
		.db	0
		.db	0
		.db	0

BVarsLen	.equ	$-BackupVars

	#if VarsLen != BVarsLen
	  #error "Разная длина поля основных и резервных переменных!!!"
	#endif

;------------------------------------------------------------------------------
; inicializacne data spritov
; - offset do zoznamu spritov (5)
; - offset do zoznamu "obsluznych" rutin (11)
InitSprData:	.db	00h,00h,18h,16h,28h,2Ch,30h,42h
		.db	38h,58h,40h,6Eh,48h,84h,50h,9Ah
		.db	58h,0B0h,10h,0C6h,60h,0DCh

		.db	70h,00h,20h,16h,78h,2Ch,78h,42h
		.db	38h,58h,28h,6Eh,0E0h,84h,0F8h,9Ah
		.db	0E8h,0B0h,0F0h,0C6h,68h,0DCh

;------------------------------------------------------------------------------
; data a masky pre nahodnu sekvenciu spritov (7)
SeqMaskTab:	.db	01h,00h,01h,04h,01h,02h,01h,06h
		.db	03h,00h,03h,04h,00h,02h,00h,06h

;------------------------------------------------------------------------------
; Score, HiScore
Score:		.db	10,10,10,10,10,10,0,-1
HiScore:	.db	10,10,10,10,10,10,0,-1

;------------------------------------------------------------------------------
; Data pre "vyparenie" Kozmickej lode
VanishData:	.db	20h		; 0
		.dw	2*SVO
		.db	04h		; 2
		.dw	-SVO
		.db	10h		; 1
		.dw	2*SVO
		.db	02h		; 3
		.dw	-3*SVO
		.db	24h		; 0
		.dw	2*SVO
		.db	24h		; 2
		.dw	-SVO
		.db	12h		; 1
		.dw	2*SVO
		.db	12h		; 3
		.dw	-3*SVO
		.db	2Dh		; 0
		.dw	2*SVO
		.db	33h		; 0
		.dw	-SVO
		.db	36h		; 1
		.dw	2*SVO
		.db	1Bh		; 3
		.dw	-3*SVO
		.db	03Fh		; 0
		.dw	2*SVO
		.db	03Fh		; 2
		.dw	-SVO
		.db	03Fh		; 1
		.dw	2*SVO
		.db	03Fh		; 3
		.dw	-3*SVO
		.db	0		; 0

;------------------------------------------------------------------------------
; rozne premenne
CtrlType:	.db	0		; sposob ovladania - 00h=Kbd, 0FFh=Joy
SpeedLevel:	.db	0		; uroven rychlosti pohybu spritov
PattHeight:	.db	0		
ZoneDataPtr:	.dw	0
PattSeqPtr:	.dw	0
IncSeq0F:	.db	2		; inkrement pre premennu Seq0F
IncSeq10:	.db	2		; inkrement pre premennu Seq10
CntSeq0F:	.db	0		; pocitadlo pre premennu Seq0F
CntSeq10:	.db	0		; pocitadlo pre premennu Seq10
RndVal:		.db	0		; posledna nahodna hodnota
SubZoneOffVO:	.dw	0		; offset pre VO
SubZoneIncCnt:	.db	0		; inkrement poctu vykreslovanych spritov
SubZoneSprAdr:	.dw	0		; adresa spritu pri vykresleni Zony 0

;------------------------------------------------------------------------------
CharBuf:	.ds	5		; buffer pre tlac znaku
RoughAdrs:	.ds	12*2+1		; adresy VO2 vykreslenych drsnych povrchov

;------------------------------------------------------------------------------

VarSpaceEnd	.equ	$

		.org  (($ + 0FFH) & 0FF00H)	; align 256

VarSpaceMax	.equ	$

;------------------------------------------------------------------------------
; Tabulka obsluznych rutin spracovania kolizie spritov.
; 
; (IX+11)=offset=00h,16h,2Ch,42h,58h,6Eh,84h,9Ah,0B0h,0C6h,0DCh
; N=2*<0, 11>
RtnList:	.dw	VortHit,ShotFlyOffV,VortBlast,VortBlast		; 00h - Vorton, 10h - Auto-Vorton
		.dw	VortBlast,VortBlast,VortBlast,VortHit
		.dw	VortHit,PushLTron,VortBlkBrl
		.dw	ShotFlyOff,NextCSpr,ShotEnemy,ShotEnemy		; 01h - Shot, 11h - Lasetrton-Shot
		.dw	ShotEnemy,ShotFlyOff,NextCSpr,ShotOff
		.dw	ShotBrick,NextCSpr,ShotBlkBrl
		.dw	EnemyBlast,EnemyShot,ChDir2,ChDir2		; 02h - Cyclop, 12h - Disk
		.dw	ChDir2,ChDir2,ChDir2,ChDir2
		.dw	ChDir2,ChDir2,ChDir2
		.dw	EnemyBlast,EnemyShot,ChDir3,ChDir3		; 03h - Eye, 13h - Disk
		.dw	ChDir3,ChDir3,NextCSpr,ChDir3
		.dw	ChDir3,ChDir3,ChDir3
		.dw	EnemyBlast,EnemyShot,ChDir4,ChDir4		; 04h - Frog, 14h - Frog
		.dw	ChDir4,ChDir4,ChDir4,ChDir4
		.dw	ChDir4,ChDir4,ChDir4
		.dw	EnemyBlast,ShotFlyOffV,ChDir5,ChDir5		; 05h - Star, 15h - Cyclop
		.dw	ChDir5,ChDir5,NextCSpr,ChDir5
		.dw	ChDir5,ChDir5,ChDir5
		.dw	NextMSprSB,NextMSprSB,NextMSprSB,NextMSprSB	; 06h - Flame, 16h - Rough
		.dw	NextMSprSB,NextMSprSB,NextMSprSB,NextMSprSB
		.dw	NextMSprSB,NextMSprSB,NextMSprSB
		.dw	NextMSprSB,NextMSprSB,NextMSprSB,NextMSprSB	; 07h - GlassBrick, 17h - GlassBrick
		.dw	NextMSprSB,NextMSprSB,NextMSprSB,NextMSprSB
		.dw	NextMSprSB,NextMSprSB,NextMSprSB
		.dw	NextMSprSB,NextMSprSB,NextMSprSB,NextMSprSB	; 08h - BrickB, 18h - BrickA
		.dw	NextMSprSB,NextMSprSB,NextMSprSB,NextMSprSB
		.dw	NextMSprSB,NextMSprSB,NextMSprSB
		.dw	NextMSprSB,NextCSpr,NextMSprSB,NextMSprSB	; 09h - Lasertron, 19h - BrickA
		.dw	NextMSprSB,NextMSprSB,NextCSpr,NextMSprSB
		.dw	NextMSprSB,NextCSpr,NextMSprSB
		.dw	NextMSprSB,NextCSpr,NextMSprSB,NextMSprSB	; 0Ah - Block, 1Ah - Barrel
		.dw	NextMSprSB,NextMSprSB,NextMSprSB,NextMSprSB
		.dw	NextMSprSB,NextMSprSB,BlkBrlHit

;------------------------------------------------------------------------------

		.org  (($ + 0FFH) & 0FF00H)	; align 256

;------------------------------------------------------------------------------
; tabulka adries spritov - sekvencie spritov					; (ix+5) (ix+6)
SprAddrs:	.dw	SprVortonE,SprVortonSE,SprVortonS,SprVortonSW		; 00h	 00h	  
		.dw	SprVortonW,SprVortonNW,SprVortonN,SprVortonNE
		.dw	SprLasertron1,SprLasertron2,SprLasertron3,SprLasertron4	; 10h	 09h
		.dw	SprShot1,SprShot2,SprShot1,SprShot2			; 18h	 01h
		.dw	SprLasShot1,SprLasShot2,SprLasShot1,SprLasShot2		; 20h	 11h
		.dw	SprCyclopS,SprCyclopW,SprCyclopN,SprCyclopE		; 28h	 02h/15h
		.dw	SprEyeS,SprEyeW,SprEyeN,SprEyeE				; 30h	 03h
		.dw	SprFrog1,SprFrog2,SprFrog3,SprFrog4			; 38h	 04h/14h
		.dw	SprStar1,SprStar2,SprStar3,SprStar4			; 40h	 05h
		.dw	SprFlame1,SprFlame2,SprFlame3,SprFlame4			; 48h	 06h
		.dw	SprGlassBrick,SprGlassBrick,SprGlassBrick,SprGlassBrick	; 50h	 07h
		.dw	SprBrickB1,SprBrickB2,SprBrickB3,SprBrickB4		; 58h	 08h
		.dw	SprBlock,SprBlock,SprBlock,SprBlock			; 60h	 0Ah
		.dw	SprBarrel,SprBarrel,SprBarrel,SprBarrel			; 68h	 1Ah
		.dw	SprAutoVorton,SprAutoVorton,SprAutoVorton,SprAutoVorton	; 70h	 10h
		.dw	SprDisc1,SprDisc2,SprDisc1,SprDisc2			; 78h	 12h/13h
		.dw	SprBlast1,SprBlast1,SprBlast1,SprBlast1			; 80h
		.dw	SprBlast1,SprBlast1,SprBlast1,SprBlast1
		.dw	SprBlast2,SprBlast2,SprBlast2,SprBlast2
		.dw	SprBlast2,SprBlast2,SprBlast2,SprBlast2
		.dw	SprBlast3,SprBlast3,SprBlast3,SprBlast3
		.dw	SprBlast3,SprBlast3,SprBlast3,SprBlast3
		.dw	SprBlast4,SprBlast4,SprBlast4,SprBlast4
		.dw	SprBlast4,SprBlast4,SprBlast4,SprBlast4
		.dw	SprBlast5,SprBlast5,SprBlast5,SprBlast5
		.dw	SprBlast5,SprBlast5,SprBlast5,SprBlast5
		.dw	SprBlast6,SprBlast6,SprBlast6,SprBlast6
		.dw	SprBlast6,SprBlast6,SprBlast6,SprBlast6
		.dw	SprRough,SprRough,SprRough,SprRough			; 0E0h	 16h
		.dw	SprBrickA1,SprBrickA2,SprBrickA3,SprBrickA1		; 0E8h	 18h
		.dw	SprBrickA2,SprBrickA2,SprBrickA2,SprBrickA2		; 0F0h	 19h
		.dw	SprGlassBrick,SprGlassBrick,SprGlassBrick,SprGlassBrick	; 0F8h	 17h

; (ix+6) >> (ix+10)
; 00 >> 0E
; 01 >> 11 12
; 02 >> 11 12
; 03 >> 10 11 12
; 04 >> 0F 10 11 12
; 05 >> 0F 10
; 06 >> 0F 10 11 12
; 07 >> 0D
; 08 >> 0D
; 09 >> 0D
; 0A >> 0D
; 10 >> 0D
; 13 >> 12 13
; 15 >> 12
; 16 >> 0D
; 17 >> 0D
; 18 >> 0D
; 19 >> 0D
; 1A >> 0D

;------------------------------------------------------------------------------
; последовательности паттернов, из которых рисуется область вокруг трассы зоны
; - 128 x 12 = 1536 байт
PattSeq:	;binclude "../data/patt-seq.bin"
	.db	$03,$05,$04,$03,$05,$07,$09,$0B,$0D,$0F,$11,$13
	.db	$04,$03,$05,$04,$06,$08,$0A,$0C,$0E,$10,$12,$14
	.db	$15,$17,$19,$1C,$1D,$21,$23,$21,$23,$21,$23,$21
	.db	$16,$18,$1A,$1D,$20,$22,$20,$22,$20,$22,$20,$22
	.db	$15,$17,$17,$1B,$1E,$21,$23,$21,$23,$21,$23,$21
	.db	$15,$17,$19,$1C,$1D,$3F,$41,$41,$41,$41,$41,$41
	.db	$16,$18,$1A,$1D,$1D,$40,$42,$42,$42,$42,$42,$42
	.db	$15,$17,$17,$1B,$1E,$3F,$41,$41,$41,$41,$41,$41
	.db	$15,$17,$17,$17,$1F,$21,$23,$21,$23,$21,$23,$21
	.db	$16,$18,$18,$18,$20,$22,$20,$22,$20,$22,$20,$22
	.db	$15,$17,$17,$17,$1F,$3F,$41,$41,$41,$41,$41,$41
	.db	$16,$18,$18,$18,$43,$40,$42,$42,$42,$42,$42,$42
	.db	$23,$21,$23,$21,$23,$21,$23,$21,$23,$25,$11,$13
	.db	$20,$22,$20,$22,$20,$22,$20,$22,$20,$24,$12,$14
	.db	$44,$44,$44,$44,$44,$44,$44,$44,$44,$44,$27,$29
	.db	$44,$44,$44,$44,$44,$44,$44,$44,$44,$26,$28,$2A
	.db	$2B,$2D,$2F,$38,$39,$3A,$3A,$3A,$3B,$44,$44,$44
	.db	$2C,$2E,$37,$3A,$3A,$3A,$3A,$3A,$3C,$44,$44,$44
	.db	$2B,$33,$35,$45,$45,$45,$45,$45,$45,$3D,$44,$44
	.db	$2C,$34,$36,$45,$45,$45,$45,$45,$45,$3E,$44,$44
	.db	$2B,$2D,$2F,$46,$32,$44,$44,$44,$44,$44,$44,$44
	.db	$2C,$2E,$30,$31,$44,$44,$44,$44,$44,$44,$44,$44
	.db	$41,$41,$47,$21,$23,$21,$23,$21,$23,$49,$4B,$4D
	.db	$42,$42,$48,$55,$20,$22,$20,$22,$20,$4A,$4C,$5C
	.db	$41,$41,$41,$41,$47,$21,$23,$21,$23,$49,$4B,$4D
	.db	$41,$41,$41,$41,$40,$21,$23,$21,$23,$49,$4B,$4D
	.db	$42,$42,$42,$3F,$20,$22,$20,$22,$20,$4A,$4C,$5C
	.db	$4E,$56,$59,$59,$5A,$1D,$20,$22,$20,$22,$20,$22
	.db	$15,$50,$1D,$57,$59,$59,$5B,$21,$23,$21,$23,$21
	.db	$4F,$51,$53,$58,$59,$59,$5A,$1D,$20,$22,$20,$22
	.db	$15,$50,$52,$54,$1D,$57,$59,$59,$5B,$21,$23,$21
	.db	$4F,$51,$53,$51,$53,$58,$59,$59,$5A,$1D,$20,$22
	.db	$15,$50,$52,$54,$52,$54,$1D,$57,$59,$59,$5B,$21
	.db	$4F,$51,$53,$51,$53,$51,$53,$58,$59,$59,$5A,$1D
	.db	$15,$50,$52,$54,$52,$54,$52,$54,$52,$54,$52,$54
	.db	$4F,$51,$53,$51,$53,$51,$53,$51,$53,$51,$53,$51
	.db	$04,$03,$05,$07,$09,$0B,$0D,$5D,$23,$49,$4B,$4D
	.db	$05,$04,$06,$08,$0A,$0C,$0E,$5E,$20,$5F,$60,$5C
	.db	$44,$44,$44,$44,$44,$44,$44,$44,$44,$25,$11,$13
	.db	$44,$44,$44,$44,$44,$44,$44,$44,$44,$63,$12,$14
	.db	$44,$44,$44,$44,$44,$44,$44,$44,$44,$64,$11,$13
	.db	$69,$69,$69,$69,$69,$69,$6A,$3A,$3A,$6C,$28,$2A
	.db	$1D,$1D,$1D,$1D,$1D,$1D,$1D,$6B,$3A,$3A,$6D,$29
	.db	$6E,$6E,$6E,$6E,$6E,$6E,$6F,$1D,$6A,$D0,$28,$2A
	.db	$6E,$6E,$6E,$6E,$6E,$6E,$6E,$70,$71,$76,$6D,$29
	.db	$6E,$6E,$6E,$6E,$6E,$6E,$72,$74,$9F,$79,$28,$2A
	.db	$6E,$6E,$6E,$6E,$6E,$6E,$6E,$73,$75,$78,$D1,$29
	.db	$6E,$6E,$6E,$6E,$6E,$6E,$72,$74,$9F,$7A,$28,$2A
	.db	$2B,$2D,$2F,$38,$39,$3C,$44,$44,$44,$44,$44,$44
	.db	$2C,$2E,$37,$3A,$3A,$3A,$3B,$44,$44,$44,$44,$44
	.db	$2B,$33,$35,$45,$45,$45,$45,$3E,$44,$44,$44,$44
	.db	$8E,$34,$36,$45,$45,$45,$3D,$44,$44,$44,$44,$44
	.db	$01,$7B,$A3,$80,$81,$8B,$8C,$8D,$44,$44,$44,$44
	.db	$01,$7B,$A3,$80,$81,$86,$85,$88,$8A,$44,$44,$44
	.db	$7F,$80,$A2,$82,$83,$84,$87,$89,$44,$44,$44,$44
	.db	$D2,$D2,$D2,$D2,$D2,$8F,$90,$73,$75,$78,$7B,$7D
	.db	$D2,$D2,$D2,$D2,$91,$92,$72,$74,$9F,$7A,$7C,$00
	.db	$D2,$D2,$D2,$D2,$D2,$8F,$90,$73,$75,$7E,$7B,$7D
	.db	$D2,$D2,$D2,$D2,$D2,$8F,$90,$73,$75,$1D,$7B,$7D
	.db	$D2,$D2,$D2,$D2,$91,$92,$72,$74,$1D,$7A,$7C,$00
	.db	$15,$67,$52,$54,$52,$54,$52,$54,$52,$54,$52,$54
	.db	$2C,$68,$1D,$51,$53,$51,$53,$51,$53,$51,$53,$51
	.db	$2B,$33,$35,$65,$52,$54,$52,$54,$52,$54,$52,$54
	.db	$2C,$34,$36,$66,$1D,$51,$53,$51,$53,$51,$53,$51
	.db	$01,$94,$96,$97,$97,$98,$6E,$6E,$44,$44,$44,$44
	.db	$93,$95,$1D,$1D,$1D,$6E,$6E,$99,$44,$44,$44,$44
	.db	$01,$94,$96,$97,$97,$98,$6E,$6E,$9A,$44,$44,$44
	.db	$93,$95,$1D,$1D,$1D,$6E,$6E,$99,$9B,$44,$44,$44
	.db	$01,$A4,$A5,$80,$81,$86,$85,$88,$8A,$44,$44,$44
	.db	$93,$95,$A6,$A7,$DA,$DB,$87,$89,$44,$44,$44,$44
	.db	$01,$94,$96,$97,$97,$98,$6E,$6E,$6E,$9A,$44,$44
	.db	$93,$95,$1D,$1D,$1D,$6E,$6E,$6E,$99,$9B,$44,$44
	.db	$03,$05,$04,$03,$05,$07,$09,$0B,$D3,$D4,$D5,$7D
	.db	$51,$53,$51,$53,$51,$53,$51,$53,$51,$B5,$12,$14
	.db	$54,$52,$54,$52,$54,$52,$54,$52,$54,$25,$11,$13
	.db	$51,$53,$51,$53,$51,$53,$51,$53,$9C,$9D,$12,$14
	.db	$A8,$A9,$1D,$1D,$1D,$AA,$6E,$6E,$99,$9B,$44,$44
	.db	$15,$AE,$AF,$A1,$1D,$1D,$AB,$6E,$6E,$9A,$44,$44
	.db	$A8,$B0,$9E,$B2,$1D,$1D,$1D,$AA,$99,$9B,$44,$44
	.db	$15,$AE,$AF,$B4,$B3,$B7,$1D,$1D,$AB,$99,$44,$44
	.db	$A8,$B0,$B1,$D6,$A0,$B6,$1D,$1D,$1D,$AA,$44,$44
	.db	$15,$AE,$AF,$B4,$D7,$D9,$D7,$D9,$D7,$D9,$D7,$D9
	.db	$A8,$B0,$B1,$D6,$D8,$D6,$D8,$D6,$D8,$D6,$D8,$D6
	.db	$44,$44,$44,$44,$44,$44,$44,$44,$44,$BD,$BE,$AD
	.db	$B8,$B9,$B1,$D6,$D8,$D6,$D8,$D6,$D8,$D6,$D8,$D6
	.db	$2B,$BA,$BB,$BC,$D7,$D9,$D7,$D9,$D7,$D9,$D7,$D9
	.db	$2C,$34,$36,$66,$1D,$D6,$D8,$D6,$D8,$D6,$D8,$D6
	.db	$C5,$C7,$C3,$C5,$C7,$C4,$C4,$C4,$CD,$EF,$ED,$EB
	.db	$C4,$C4,$C4,$C6,$AC,$C3,$C5,$C7,$84,$F0,$EE,$EC
	.db	$15,$BF,$C1,$C3,$C5,$C7,$C9,$CB,$C4,$C2,$C4,$C6
	.db	$E2,$C0,$C2,$C4,$C6,$C8,$CA,$CC,$C4,$C3,$C5,$C7
	.db	$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01
	.db	$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00
	.db	$44,$44,$44,$44,$44,$44,$44,$E7,$3A,$D0,$28,$2A
	.db	$44,$44,$44,$44,$44,$44,$44,$44,$3A,$E6,$6D,$29
	.db	$44,$44,$44,$44,$44,$44,$44,$44,$3A,$E8,$28,$2A
	.db	$44,$44,$44,$44,$44,$44,$44,$44,$44,$3A,$E9,$29
	.db	$44,$44,$44,$44,$44,$44,$44,$44,$44,$3A,$EA,$2A
	.db	$2B,$2D,$2F,$46,$DC,$44,$44,$44,$44,$44,$44,$44
	.db	$2C,$2E,$30,$DE,$DD,$44,$44,$44,$44,$44,$44,$44
	.db	$2B,$2D,$2F,$46,$DF,$3A,$3B,$44,$44,$44,$44,$44
	.db	$2C,$2E,$30,$DE,$E0,$3A,$3C,$44,$44,$44,$44,$44
	.db	$E1,$34,$36,$45,$45,$45,$45,$45,$45,$3E,$44,$44
	.db	$15,$E3,$E5,$3A,$3A,$3A,$3A,$3A,$3A,$3A,$3B,$44
	.db	$E2,$E4,$3A,$E6,$3A,$3A,$3A,$3A,$3A,$3A,$3C,$44
	.db	$C5,$C7,$C3,$C5,$C7,$C4,$C4,$C4,$1D,$F1,$E9,$29
	.db	$C4,$C4,$C4,$C6,$AC,$C3,$C5,$C7,$84,$CF,$F2,$2A
	.db	$C5,$C7,$C3,$C5,$C7,$C4,$C4,$C4,$CD,$EF,$F5,$F4
	.db	$15,$E3,$E0,$3A,$3A,$3A,$3A,$3A,$3A,$3A,$3A,$3A
	.db	$E2,$F3,$3A,$3A,$3A,$3A,$3A,$3A,$3A,$3A,$3A,$3A
	.db	$15,$BF,$C1,$6A,$3A,$3A,$3A,$3A,$3A,$3A,$3A,$3A
	.db	$E2,$C0,$C2,$6B,$3A,$3A,$3A,$3A,$3A,$3A,$3A,$3A
	.db	$01,$01,$01,$01,$01,$01,$01,$01,$F6,$EF,$ED,$EB
	.db	$00,$00,$00,$00,$00,$00,$00,$00,$00,$F8,$F7,$EC
	.db	$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$01,$F9
	.db	$15,$FE,$C1,$C3,$C5,$C7,$C9,$CB,$C4,$C2,$C4,$C6
	.db	$FA,$FF,$CE,$C5,$C7,$C9,$CB,$C4,$C2,$C4,$C6,$C8
	.db	$01,$01,$FB,$FD,$C4,$C6,$C8,$CA,$CC,$C4,$C3,$C5
	.db	$00,$00,$FA,$FC,$CE,$C5,$C7,$C9,$CB,$C4,$C2,$C4
	.db	$01,$01,$01,$01,$FB,$FD,$C4,$C6,$C8,$CA,$CC,$C4
	.db	$00,$00,$00,$00,$FA,$FC,$CE,$C5,$C7,$C9,$CB,$C4
	.db	$01,$01,$01,$01,$01,$01,$FB,$FD,$C4,$C6,$C8,$CA
	.db	$00,$00,$00,$00,$00,$00,$FA,$FC,$CE,$C5,$C7,$C9
	.db	$01,$01,$01,$01,$01,$01,$01,$01,$FB,$FD,$C4,$C6
	.db	$00,$00,$00,$00,$00,$00,$00,$00,$FA,$FC,$CE,$C5
	.db	$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00

;------------------------------------------------------------------------------
; список последовательностей паттернов, формирующих область вокруг трассы зоны
; - 32 x 48 = 1536 байт
ZoneData:	;binclude "../data/zone-data.bin"
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $00,$01,$00,$01,$00,$01,$00,$01
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $04,$09,$08,$09,$02,$03,$04,$09
	.db	$08,$09,$02,$03,$04,$09,$08,$09, $02,$03,$04,$09,$08,$09,$02,$03
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $00,$01,$00,$01,$0C,$0D,$0C,$0D
	.db	$0C,$0D,$0C,$0D,$0C,$0D,$0C,$0D, $08,$09,$08,$09,$08,$09,$02,$03
	.db	$04,$09,$08,$09,$02,$03,$04,$09, $08,$09,$08,$09,$08,$09,$08,$09
	.db	$0C,$0D,$0C,$0D,$0C,$0D,$0C,$0D, $0C,$0D,$0C,$0D,$0C,$0D,$0C,$0D
	.db	$19,$1A,$19,$1A,$19,$1A,$19,$1A, $08,$09,$08,$09,$08,$09,$08,$09
	.db	$08,$09,$08,$09,$08,$09,$08,$09, $08,$09,$08,$09,$08,$09,$08,$09
	.db	$16,$17,$18,$1A,$19,$1A,$19,$1A, $19,$1A,$19,$1A,$19,$1A,$19,$1A
	.db	$19,$1A,$19,$1A,$19,$1A,$19,$1A, $08,$09,$08,$09,$08,$09,$08,$09
	.db	$08,$09,$08,$09,$08,$09,$02,$03, $04,$09,$08,$09,$02,$03,$04,$09
	.db	$19,$1A,$19,$1A,$19,$1A,$19,$1A, $19,$1A,$19,$1A,$19,$1A,$19,$1A
	.db	$19,$1A,$19,$1A,$19,$1A,$19,$1A, $08,$09,$02,$03,$04,$09,$08,$09
	.db	$02,$03,$04,$09,$08,$09,$02,$03, $04,$09,$08,$09,$02,$03,$04,$09
	.db	$19,$1A,$19,$1A,$19,$1A,$19,$1A, $19,$1A,$19,$1A,$19,$1A,$19,$1A
	.db	$19,$1A,$19,$1A,$19,$1A,$19,$1A, $04,$09,$08,$09,$02,$03,$04,$09
	.db	$08,$09,$02,$03,$04,$09,$08,$09, $08,$1B,$1C,$1D,$1E,$1F,$20,$21
	.db	$19,$1A,$19,$1A,$19,$1A,$19,$1A, $19,$1A,$19,$1A,$19,$1A,$19,$1A
	.db	$19,$1A,$19,$1A,$19,$1A,$19,$1A, $22,$23,$22,$23,$22,$23,$22,$23
	.db	$22,$23,$22,$23,$22,$23,$22,$23, $22,$23,$22,$23,$22,$23,$22,$23
	.db	$19,$1A,$19,$1A,$19,$1A,$19,$1A, $19,$1A,$19,$1A,$24,$25,$00,$01
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $22,$23,$22,$23,$22,$23,$22,$23
	.db	$22,$23,$22,$23,$22,$23,$22,$23, $22,$23,$22,$23,$22,$23,$22,$23
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $00,$01,$00,$01,$00,$01,$00,$01
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $22,$23,$22,$23,$22,$23,$22,$23
	.db	$22,$23,$22,$23,$22,$23,$22,$23, $22,$23,$22,$23,$22,$23,$22,$23
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $00,$01,$00,$01,$00,$01,$26,$27
	.db	$28,$0F,$0E,$0F,$0E,$0F,$0E,$0F, $22,$23,$22,$23,$22,$23,$22,$23
	.db	$22,$23,$22,$23,$22,$23,$22,$23, $22,$23,$22,$23,$3C,$3D,$3E,$3F
	.db	$0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F, $0E,$29,$2A,$2B,$2C,$2D,$2E,$2F
	.db	$37,$38,$37,$38,$37,$38,$37,$38, $12,$13,$12,$13,$12,$13,$12,$13
	.db	$14,$15,$14,$15,$14,$15,$14,$15, $30,$31,$32,$33,$34,$36,$35,$36
	.db	$37,$38,$37,$38,$37,$38,$37,$38, $37,$38,$37,$38,$37,$38,$37,$38
	.db	$37,$38,$37,$38,$37,$38,$37,$38, $35,$36,$35,$36,$35,$36,$35,$36
	.db	$35,$36,$35,$36,$35,$36,$35,$36, $35,$36,$35,$36,$35,$36,$35,$36
	.db	$37,$38,$37,$38,$37,$38,$37,$38, $39,$3B,$3A,$3B,$3A,$3B,$3A,$3B
	.db	$3A,$3B,$3A,$3B,$3A,$3B,$3A,$3B, $35,$36,$35,$36,$35,$36,$35,$36
	.db	$35,$36,$35,$36,$35,$36,$35,$36, $35,$36,$35,$36,$35,$36,$35,$36
	.db	$3A,$3B,$3A,$3B,$3A,$3B,$3A,$3B, $3A,$3B,$3A,$3B,$3A,$3B,$3A,$3B
	.db	$3A,$3B,$3A,$3B,$3A,$3B,$3A,$3B, $35,$36,$35,$36,$35,$36,$35,$36
	.db	$35,$36,$35,$36,$35,$36,$35,$36, $44,$45,$40,$41,$42,$43,$42,$43
	.db	$3A,$3B,$3A,$3B,$3A,$3B,$3A,$3B, $3A,$3B,$3A,$3B,$3A,$3B,$48,$01
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $46,$47,$46,$47,$46,$47,$46,$47
	.db	$46,$47,$46,$47,$46,$47,$46,$47, $46,$47,$46,$47,$46,$47,$46,$47
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $00,$01,$00,$01,$00,$01,$00,$01
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $46,$47,$46,$47,$46,$47,$46,$47
	.db	$46,$47,$46,$47,$46,$47,$46,$47, $46,$47,$46,$47,$46,$47,$46,$47
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $00,$01,$00,$01,$00,$01,$00,$01
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $46,$47,$46,$47,$46,$47,$46,$47
	.db	$46,$47,$46,$47,$46,$47,$46,$47, $46,$47,$46,$4C,$4D,$4E,$4F,$50
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $00,$01,$00,$01,$00,$01,$00,$01
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $51,$52,$51,$52,$51,$52,$51,$52
	.db	$51,$52,$51,$52,$51,$52,$51,$52, $51,$52,$51,$52,$51,$52,$51,$52
	.db	$00,$01,$00,$01,$00,$01,$00,$01, $00,$01,$00,$01,$4A,$4B,$4A,$4B
	.db	$4A,$4B,$4A,$4B,$4A,$4B,$4A,$4B, $51,$52,$51,$52,$51,$52,$51,$52
	.db	$51,$52,$51,$52,$51,$52,$51,$52, $51,$52,$51,$52,$51,$52,$51,$52
	.db	$4A,$4B,$4A,$4B,$4A,$4B,$4A,$4B, $4A,$4B,$4A,$4B,$4A,$4B,$4A,$4B
	.db	$4A,$4B,$4A,$4B,$4A,$4B,$4A,$4B, $51,$52,$51,$52,$51,$52,$51,$52
	.db	$51,$52,$51,$52,$51,$52,$51,$52, $51,$52,$51,$52,$51,$52,$51,$52
	.db	$4A,$4B,$4A,$4B,$4A,$4B,$4A,$4B, $4A,$4B,$4A,$4B,$4A,$4B,$4A,$4B
	.db	$4A,$49,$53,$0F,$0E,$0F,$0E,$0F, $51,$52,$51,$52,$51,$52,$51,$52
	.db	$51,$52,$51,$52,$51,$52,$51,$52, $51,$52,$51,$52,$51,$54,$55,$56
	.db	$0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F, $0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F
	.db	$0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F, $12,$13,$12,$13,$12,$13,$12,$13
	.db	$14,$15,$14,$15,$14,$15,$14,$15, $10,$11,$12,$13,$14,$15,$14,$15
	.db	$0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F, $0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F
	.db	$0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F, $14,$15,$14,$15,$14,$15,$10,$11
	.db	$12,$13,$14,$15,$14,$15,$14,$15, $14,$15,$10,$11,$12,$13,$14,$15
	.db	$0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F, $0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F
	.db	$0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F, $14,$15,$14,$15,$14,$15,$14,$15
	.db	$10,$11,$12,$13,$14,$15,$14,$15, $14,$15,$14,$15,$10,$11,$12,$13
	.db	$0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F, $0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F
	.db	$0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F, $12,$13,$14,$15,$14,$15,$14,$15
	.db	$14,$15,$10,$11,$12,$13,$14,$15, $14,$15,$14,$15,$14,$15,$10,$11
	.db	$0E,$0F,$0E,$0F,$0E,$0F,$0E,$0F, $0E,$0F,$0E,$0F,$0E,$0F,$0E,$5D
	.db	$5E,$5F,$60,$61,$60,$61,$60,$61, $10,$11,$12,$13,$14,$15,$14,$15
	.db	$14,$15,$14,$15,$62,$63,$64,$65, $10,$11,$12,$13,$12,$66,$67,$68
	.db	$69,$6A,$6B,$58,$57,$58,$57,$58, $57,$58,$57,$58,$57,$58,$57,$58
	.db	$57,$58,$57,$58,$57,$58,$57,$58, $67,$68,$67,$68,$67,$68,$6E,$6F
	.db	$59,$5A,$59,$5A,$59,$5A,$59,$5A, $59,$5A,$59,$5A,$59,$5A,$59,$5A
	.db	$57,$58,$57,$58,$57,$58,$57,$58, $57,$58,$57,$58,$57,$58,$57,$58
	.db	$57,$58,$57,$58,$57,$58,$57,$58, $59,$5A,$59,$5A,$59,$5A,$59,$5A
	.db	$59,$5A,$59,$5A,$59,$5A,$59,$5A, $59,$5A,$59,$5A,$59,$5A,$59,$5A
	.db	$57,$58,$57,$58,$57,$58,$57,$58, $57,$58,$57,$58,$57,$58,$57,$58
	.db	$57,$58,$57,$58,$57,$58,$57,$58, $59,$5A,$59,$5A,$59,$5A,$59,$5A
	.db	$59,$5A,$59,$5A,$59,$5A,$59,$5A, $59,$5A,$59,$5A,$59,$5A,$59,$5A
	.db	$57,$58,$57,$58,$57,$58,$57,$58, $57,$58,$57,$58,$57,$58,$57,$58
	.db	$57,$58,$57,$58,$57,$58,$57,$58, $59,$5A,$59,$5A,$59,$5A,$59,$5A
	.db	$59,$5A,$59,$5A,$59,$5A,$59,$5A, $59,$5A,$59,$5A,$59,$5A,$59,$5A
	.db	$57,$58,$57,$58,$70,$71,$72,$5C, $5B,$5C,$5B,$5C,$5B,$5C,$5B,$5C
	.db	$5B,$5C,$5B,$5C,$5B,$5C,$5B,$5C, $59,$5A,$59,$5A,$59,$5A,$59,$5A
	.db	$73,$74,$75,$76,$77,$78,$79,$7A, $7B,$7C,$5B,$5C,$5B,$5C,$5B,$5C
	.db	$5B,$5C,$5B,$5C,$5B,$5C,$5B,$5C, $5B,$5C,$5B,$5C,$5B,$5C,$5B,$5C
	.db	$5B,$5C,$5B,$5C,$5B,$5C,$5B,$5C, $5B,$5C,$5B,$5C,$5B,$5C,$5B,$5C
	.db	$5B,$5C,$5B,$5C,$5B,$5C,$5B,$5C, $5B,$5C,$5B,$5C,$5B,$5C,$5B,$5C

;------------------------------------------------------------------------------
; паттерны для построения области вокруг зоны
; - 256 x 8 = 2048 байт
Patts:		;binclude "../data/patts.bin"
	.db	$02,$08,$20,$80,$40,$10,$04,$01, $40,$10,$04,$01,$02,$08,$20,$80
	.db	$C0,$30,$0C,$03,$C0,$30,$0C,$03, $EE,$EC,$ED,$ED,$ED,$E9,$E3,$F3
	.db	$2F,$AF,$8F,$9F,$BF,$BF,$9F,$CF, $F3,$F7,$F7,$E7,$EF,$EF,$EF,$EF
	.db	$EF,$EF,$EF,$EF,$E7,$F7,$F7,$F7, $CF,$DF,$DF,$DF,$DF,$DF,$9F,$3F
	.db	$F3,$F9,$FD,$FD,$FD,$FC,$FC,$FE, $7F,$7F,$7F,$7F,$7F,$7F,$7F,$7F
	.db	$FE,$FE,$FE,$FE,$FE,$FE,$FE,$FE, $7F,$7F,$7F,$7F,$7F,$7F,$7F,$3F
	.db	$FE,$FE,$FC,$FC,$FC,$FC,$FC,$FC, $3F,$3F,$1F,$0F,$0F,$07,$01,$02
	.db	$F8,$F0,$E0,$E0,$E0,$C0,$C0,$40, $02,$02,$00,$00,$03,$0F,$3D,$F6
	.db	$C3,$8F,$3D,$F6,$DB,$6F,$BC,$73, $DB,$6F,$BC,$73,$47,$34,$F3,$CF
	.db	$47,$34,$F3,$CF,$3C,$73,$47,$34, $3C,$73,$47,$35,$F2,$C8,$20,$80
	.db	$F2,$C8,$20,$80,$40,$10,$04,$01, $40,$10,$04,$01,$02,$08,$23,$8F
	.db	$02,$08,$23,$8F,$3F,$7C,$73,$47, $3F,$7C,$73,$47,$37,$F4,$F3,$CF
	.db	$37,$F4,$F3,$CF,$3F,$7C,$73,$47, $3F,$7C,$73,$47,$36,$F4,$F0,$C8
	.db	$2C,$E3,$CF,$3F,$FF,$3F,$0F,$03, $1F,$E4,$F9,$FD,$FD,$FE,$FE,$FE
	.db	$30,$60,$60,$40,$00,$C0,$80,$80, $00,$00,$00,$00,$00,$00,$00,$00
	.db	$FE,$3E,$0E,$02,$01,$00,$00,$00, $3F,$7C,$73,$47,$37,$F4,$F0,$C0
	.db	$C3,$6C,$30,$F2,$36,$3C,$1C,$1C, $00,$00,$00,$00,$02,$A6,$64,$64
	.db	$9C,$2C,$0C,$02,$00,$00,$00,$00, $2C,$38,$38,$70,$B0,$30,$38,$02
	.db	$93,$0F,$3D,$F6,$DB,$6F,$BC,$73, $00,$00,$00,$00,$03,$0F,$3D,$F6
	.db	$00,$00,$00,$00,$00,$01,$07,$13, $00,$01,$07,$1F,$7F,$FF,$FF,$FE
	.db	$7C,$FF,$FF,$FE,$FA,$EA,$A8,$A0, $FA,$2A,$A8,$A0,$82,$08,$20,$80
	.db	$82,$08,$20,$80,$40,$10,$04,$01, $40,$10,$04,$01,$00,$01,$07,$1F
	.db	$00,$01,$07,$1F,$7F,$3F,$CF,$F3, $7F,$FF,$FF,$FF,$FD,$F7,$DC,$70
	.db	$FD,$F5,$DC,$70,$C2,$0E,$3E,$FE, $C3,$0F,$3F,$FF,$FF,$FF,$FF,$FE
	.db	$FE,$FE,$FE,$FE,$F8,$E5,$9B,$77, $EE,$D9,$A7,$1F,$7E,$F8,$E0,$80
	.db	$7E,$F8,$E0,$80,$00,$00,$00,$00, $7F,$FF,$FF,$FF,$FD,$F4,$D2,$4A
	.db	$FD,$F5,$D2,$4A,$29,$A5,$91,$45, $29,$A4,$91,$45,$17,$5F,$7F,$FF
	.db	$17,$5F,$7F,$FF,$FF,$FF,$FF,$FF, $FE,$FE,$FE,$FE,$F9,$E7,$9F,$7F
	.db	$F8,$E5,$9B,$77,$EF,$DF,$BF,$7F, $3F,$BF,$BF,$BF,$7F,$FF,$FF,$FF
	.db	$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF, $7F,$1F,$07,$01,$00,$00,$00,$00
	.db	$FF,$FF,$FF,$FF,$7F,$1F,$07,$01, $FF,$FF,$FF,$FF,$FE,$F8,$E0,$80
	.db	$FE,$F8,$E0,$80,$00,$00,$00,$00, $92,$92,$D4,$D2,$16,$86,$80,$00
	.db	$12,$1A,$82,$80,$82,$88,$A0,$82, $12,$8A,$A0,$92,$56,$54,$55,$D4
	.db	$92,$92,$D4,$D2,$16,$86,$20,$AA, $37,$F4,$F0,$C0,$00,$00,$00,$00
	.db	$00,$00,$00,$00,$00,$00,$00,$00, $FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF
	.db	$F8,$E5,$9B,$77,$EE,$D9,$A7,$1F, $12,$CA,$32,$0C,$83,$20,$08,$02
	.db	$92,$92,$D4,$D2,$16,$C6,$30,$0C, $00,$00,$00,$00,$02,$08,$20,$80
	.db	$42,$48,$60,$C0,$40,$42,$48,$60, $40,$02,$48,$20,$C0,$00,$42,$08
	.db	$C0,$40,$42,$48,$61,$C7,$5F,$7C, $61,$87,$1F,$7C,$32,$C8,$20,$80
	.db	$02,$08,$23,$8F,$1F,$5F,$6F,$6F, $02,$08,$23,$8F,$1F,$DF,$EF,$01
	.db	$1E,$DE,$EE,$EF,$F7,$F4,$F0,$C2, $54,$AA,$5D,$3A,$55,$3E,$7C,$2D
	.db	$00,$00,$20,$54,$28,$55,$EA,$7D, $9C,$2D,$0C,$02,$00,$00,$00,$00
	.db	$AE,$5C,$FA,$3C,$BA,$38,$18,$02, $83,$20,$08,$02,$00,$00,$00,$00
	.db	$77,$74,$10,$00,$C0,$B0,$5C,$AB, $C0,$B0,$5C,$AB,$55,$AA,$55,$AA
	.db	$00,$00,$00,$00,$C0,$B0,$5C,$AB, $55,$AA,$55,$AA,$55,$AA,$55,$AA
	.db	$55,$AA,$55,$AA,$55,$0A,$05,$00, $55,$0A,$05,$00,$00,$00,$00,$00
	.db	$72,$C8,$20,$80,$40,$10,$04,$01, $02,$02,$00,$00,$02,$A6,$64,$64
	.db	$C0,$80,$00,$00,$00,$00,$00,$00, $43,$4F,$45,$DE,$5D,$5F,$5C,$5D
	.db	$DD,$5C,$5D,$5F,$5C,$DD,$45,$40, $FF,$3F,$0F,$03,$00,$00,$00,$00
	.db	$FF,$FF,$FF,$FF,$FF,$3F,$0F,$03, $03,$0F,$3D,$F6,$DB,$6F,$BC,$73
	.db	$00,$00,$00,$00,$00,$00,$3C,$F6, $3F,$0F,$03,$00,$00,$00,$00,$00
	.db	$FF,$FF,$FF,$FF,$3F,$0F,$03,$00, $1F,$D7,$ED,$EF,$F7,$F7,$F3,$C0
	.db	$FD,$F5,$D2,$4A,$29,$A4,$91,$C0, $80,$80,$80,$80,$80,$80,$80,$80
	.db	$C0,$F0,$FC,$FF,$FF,$FF,$FF,$FF, $00,$00,$00,$00,$C0,$F0,$FC,$FF
	.db	$FF,$3F,$0F,$03,$00,$01,$07,$13, $FE,$F9,$E7,$9F,$7F,$FF,$FF,$FE
	.db	$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF, $3F,$8F,$A3,$A8,$AA,$2A,$0A,$02
	.db	$FF,$FC,$F2,$C9,$24,$B2,$A9,$A4, $AB,$2C,$00,$00,$00,$00,$00,$00
	.db	$FF,$FF,$FF,$FF,$FF,$FC,$F2,$C9, $FF,$FC,$F2,$C9,$24,$92,$49,$24
	.db	$24,$92,$49,$24,$93,$4C,$30,$C0, $93,$4C,$30,$C0,$00,$00,$00,$00
	.db	$09,$0C,$08,$08,$C8,$F0,$FC,$FF, $40,$00,$00,$00,$02,$08,$20,$80
	.db	$09,$0C,$18,$48,$08,$08,$00,$00, $00,$00,$00,$00,$00,$01,$07,$13
	.db	$00,$00,$00,$00,$03,$0C,$32,$C9, $03,$0C,$32,$C9,$24,$92,$49,$24
	.db	$24,$92,$49,$24,$93,$4C,$30,$C0, $93,$4C,$30,$C1,$02,$08,$20,$80
	.db	$08,$08,$18,$48,$08,$08,$00,$00, $02,$08,$20,$80,$03,$0C,$32,$C9
	.db	$24,$92,$49,$24,$92,$49,$24,$92, $4B,$2C,$B0,$C0,$00,$C0,$30,$0C
	.db	$92,$49,$24,$92,$4B,$2C,$B0,$C0, $00,$00,$00,$00,$03,$0C,$30,$C0
	.db	$00,$00,$00,$00,$03,$0F,$3F,$FF, $02,$0E,$3E,$FE,$FC,$F0,$C3,$07
	.db	$03,$0C,$30,$C0,$00,$C0,$30,$0C, $FC,$F0,$C3,$0F,$3F,$FF,$FF,$FF
	.db	$37,$F7,$F7,$F7,$F7,$F7,$F7,$F7, $FF,$FF,$FF,$FF,$FC,$F0,$C0,$00
	.db	$F4,$F0,$C0,$00,$00,$00,$00,$00, $03,$0C,$30,$C0,$00,$40,$A0,$54
	.db	$AA,$54,$AA,$54,$AA,$54,$AB,$55, $AB,$55,$AB,$55,$2B,$15,$03,$01
	.db	$01,$04,$10,$00,$63,$F8,$FE,$FF, $09,$0C,$18,$48,$08,$08,$00,$00
	.db	$03,$0F,$3F,$FF,$FF,$FF,$FF,$FF, $00,$00,$00,$00,$01,$04,$10,$40
	.db	$00,$00,$00,$00,$03,$0F,$3F,$FF, $02,$08,$20,$80,$00,$00,$00,$00
	.db	$01,$00,$01,$00,$01,$0A,$15,$AA, $55,$00,$00,$00,$00,$00,$00,$00
	.db	$55,$AA,$55,$2A,$15,$0A,$05,$02, $05,$02,$05,$02,$05,$02,$05,$02
	.db	$05,$02,$05,$02,$05,$02,$05,$03, $FF,$FF,$FF,$FF,$FE,$F7,$FD,$DE
	.db	$FF,$FD,$FB,$EC,$F0,$A0,$C0,$00, $6C,$F0,$80,$00,$00,$00,$00,$00
	.db	$54,$AA,$5D,$3A,$55,$3E,$7C,$2C, $A3,$0F,$3D,$F6,$DB,$6F,$BC,$73
	.db	$F8,$FE,$F9,$E7,$9F,$7F,$FF,$FF, $00,$00,$00,$00,$01,$04,$10,$40
	.db	$8E,$2C,$8C,$22,$08,$02,$80,$20, $F7,$3B,$0D,$03,$00,$00,$00,$00
	.db	$49,$24,$92,$49,$24,$92,$49,$24, $92,$49,$24,$92,$49,$24,$92,$49
	.db	$03,$0D,$34,$D1,$45,$94,$51,$25, $94,$49,$25,$92,$49,$24,$92,$49
	.db	$00,$00,$00,$00,$00,$80,$40,$20, $90,$48,$24,$92,$4B,$2D,$B1,$C1
	.db	$02,$08,$23,$8F,$3F,$BE,$DD,$EE, $F7,$FB,$FD,$FE,$FF,$3F,$0F,$03
	.db	$C0,$F0,$FC,$FF,$FF,$FF,$FF,$FF, $00,$00,$00,$00,$C0,$F0,$FC,$FF
	.db	$AF,$AF,$AD,$AD,$AD,$A9,$A9,$A9, $7A,$6A,$28,$20,$02,$08,$20,$80
	.db	$3F,$FE,$F9,$E7,$9F,$7F,$FE,$F9, $67,$9F,$DF,$EF,$77,$BA,$DD,$EF
	.db	$77,$3B,$1D,$0E,$07,$03,$81,$E0, $F8,$FE,$F9,$E7,$9F,$7F,$FF,$E1
	.db	$FC,$F0,$C0,$00,$C0,$30,$0C,$03, $08,$02,$80,$20,$08,$02,$00,$00
	.db	$77,$3B,$FD,$FE,$FC,$F0,$C0,$00, $A0,$0E,$3D,$F6,$DB,$6F,$BC,$73
	.db	$08,$02,$00,$00,$C0,$30,$0C,$03, $C0,$30,$0C,$03,$00,$00,$00,$00
	.db	$00,$01,$03,$19,$7E,$9F,$C7,$E9, $74,$3A,$1D,$0E,$07,$03,$81,$E0
	.db	$7F,$FF,$FF,$FF,$7D,$94,$E2,$F8, $7E,$98,$46,$AE,$5E,$AE,$DE,$EE
	.db	$76,$3A,$FC,$FE,$FC,$F0,$C0,$00, $00,$00,$00,$00,$00,$80,$E0,$B8
	.db	$6E,$19,$07,$1F,$7F,$7F,$7F,$7E, $3F,$FF,$FF,$FF,$FE,$F8,$E0,$80
	.db	$01,$07,$1F,$7F,$FF,$FF,$FF,$FF, $FF,$FC,$FD,$E1,$C9,$89,$88,$88
	.db	$ED,$0D,$0D,$2D,$2D,$2D,$2D,$2C, $84,$82,$82,$82,$82,$82,$82,$82
	.db	$0D,$0D,$0D,$2D,$2D,$2D,$2D,$2C, $82,$41,$40,$40,$40,$40,$20,$A0
	.db	$35,$35,$B3,$AB,$AB,$A7,$A7,$A7, $A4,$A4,$A4,$A4,$A4,$A4,$A4,$A4
	.db	$96,$8E,$8E,$8E,$8E,$8D,$4D,$4D, $6B,$6D,$6F,$EF,$ED,$FF,$DB,$FE
	.db	$B2,$BF,$BD,$EF,$FB,$FF,$BF,$C3, $FD,$F7,$DF,$7B,$EC,$B6,$D6,$D6
	.db	$01,$01,$09,$09,$89,$89,$89,$89, $35,$34,$B2,$A8,$A8,$A0,$80,$00
	.db	$FF,$3F,$BF,$87,$93,$91,$11,$11, $7F,$BF,$DF,$EF,$F7,$3B,$CD,$F2
	.db	$FF,$FF,$FF,$FF,$FE,$F9,$E7,$93, $00,$01,$07,$1F,$7F,$FF,$FF,$FE
	.db	$00,$00,$00,$00,$00,$00,$00,$00, $BF,$3F,$1F,$CF,$0F,$07,$01,$02
	.db	$02,$02,$70,$BC,$6F,$DB,$F7,$3C, $CF,$E3,$2C,$CF,$33,$9C,$4F,$27
	.db	$0C,$55,$5D,$4F,$2D,$9D,$8D,$7D, $08,$02,$80,$10,$52,$4A,$5A,$5C
	.db	$8E,$2C,$8C,$22,$08,$02,$00,$00, $59,$BD,$9D,$79,$9E,$38,$98,$22
	.db	$01,$01,$01,$01,$03,$0D,$31,$C1, $01,$01,$01,$01,$03,$0F,$3F,$FF
	.db	$7E,$F9,$E7,$81,$00,$00,$00,$00, $7F,$FF,$FF,$FF,$7F,$1F,$07,$01
	.db	$EE,$D9,$A7,$1F,$7E,$F9,$E7,$9F, $7E,$F9,$E7,$9F,$7F,$FF,$FF,$FF
	.db	$7F,$FF,$FF,$FF,$FF,$FF,$FF,$FF, $02,$08,$23,$8F,$3F,$3F,$CF,$F3
	.db	$02,$08,$23,$8F,$37,$FB,$FD,$FE, $3F,$FF,$FF,$FF,$FE,$F9,$E7,$9F
	.db	$FE,$F9,$E7,$9F,$7F,$FF,$FF,$FF, $7F,$FF,$FF,$FF,$3F,$CF,$F3,$FC
	.db	$3F,$CF,$F3,$FC,$FF,$FF,$FF,$FF, $03,$0F,$3F,$FF,$3F,$CF,$F3,$FC
	.db	$FF,$FF,$FF,$FF,$3F,$CF,$EF,$93, $FF,$FF,$FF,$FF,$FF,$FF,$FF,$FE
	.db	$FF,$FF,$FF,$FE,$FA,$EA,$A8,$A0, $86,$39,$DE,$E0,$E2,$88,$20,$80
	.db	$E2,$88,$20,$80,$40,$10,$04,$01, $E9,$C7,$1F,$7D,$F7,$DE,$78,$E2
	.db	$B7,$9E,$78,$A3,$8F,$3F,$FE,$F8, $03,$0F,$3F,$FF,$FF,$FF,$F0,$EE
	.db	$7F,$BF,$DF,$EC,$F1,$C7,$1F,$7D, $01,$01,$C1,$F1,$FC,$FF,$FF,$FF
	.db	$FC,$FF,$FF,$FE,$FA,$EA,$A8,$A0, $01,$07,$1F,$7F,$BF,$0F,$03,$00
	.db	$76,$39,$9E,$80,$82,$08,$20,$80, $E9,$E7,$E3,$EB,$E7,$E2,$E8,$E2
	.db	$40,$10,$04,$01,$02,$C8,$30,$0C, $BF,$BF,$7F,$BF,$BF,$3F,$FE,$F8
	.db	$02,$88,$C0,$E0,$F0,$F8,$FC,$7E, $40,$90,$C4,$E1,$E2,$88,$20,$80
	.db	$02,$08,$20,$80,$40,$10,$C4,$F1, $40,$10,$C4,$F1,$EC,$DF,$BF,$7F
	.db	$FC,$FF,$FF,$FF,$7F,$1F,$07,$01, $80,$E0,$F8,$FE,$FF,$FF,$FF,$FF
	.db	$2A,$F5,$FA,$FD,$FE,$F8,$E0,$80, $AC,$5F,$BF,$7F,$7F,$1F,$07,$01

;------------------------------------------------------------------------------
; Глобальная таблица объектов
; - 249 x 16 = 3984 байт
SprList:	;binclude "../data/spr-data.bin"
	.db	$FE,$DE,$01,$99,$DC,$D8,$02,$02, $01,$0C,$11,$2C,$04,$24,$74,$02
	.db	$36,$50,$02,$A6,$D4,$60,$06,$00, $00,$04,$12,$DC,$00,$38,$50,$02
	.db	$3E,$50,$02,$25,$D4,$60,$0A,$00, $00,$04,$0D,$DC,$00,$40,$50,$02
	.db	$46,$50,$02,$A4,$D3,$60,$0A,$00, $00,$04,$0D,$DC,$00,$48,$50,$02
	.db	$00,$78,$02,$92,$D5,$48,$06,$00, $00,$00,$10,$84,$00,$00,$78,$02
	.db	$36,$8A,$02,$0D,$D1,$68,$1A,$06, $00,$08,$0D,$DC,$00,$20,$C6,$01
	.db	$08,$D8,$01,$FD,$DE,$68,$1A,$01, $01,$00,$0D,$DC,$00,$12,$CE,$01
	.db	$00,$DA,$01,$5E,$DF,$68,$1A,$01, $00,$04,$0D,$DC,$00,$06,$D4,$01
	.db	$40,$8E,$02,$2C,$D0,$68,$1A,$06, $00,$0C,$0D,$DC,$00,$28,$D8,$01
	.db	$36,$D2,$01,$76,$DC,$68,$1A,$00, $00,$08,$0D,$DC,$00,$36,$D2,$01
	.db	$42,$D6,$01,$75,$DB,$68,$1A,$00, $00,$08,$0D,$DC,$00,$42,$D6,$01
	.db	$24,$C0,$03,$F6,$BE,$E8,$18,$00, $00,$08,$0D,$B0,$00,$28,$B4,$03
	.db	$24,$C8,$03,$77,$BE,$E8,$18,$00, $00,$08,$0D,$B0,$00,$20,$DC,$03
	.db	$24,$D0,$03,$F8,$BD,$E8,$1A,$00, $00,$08,$0D,$B0,$00,$2D,$EE,$03
	.db	$34,$B4,$03,$B3,$BE,$50,$1A,$00, $00,$00,$0D,$9A,$00,$34,$FA,$03
	.db	$14,$DC,$03,$3C,$BE,$50,$03,$00, $01,$00,$11,$9A,$06,$14,$B2,$05
	.db	$3C,$B4,$03,$32,$BE,$40,$05,$02, $01,$00,$0F,$6E,$02,$42,$B4,$03
	.db	$0C,$DC,$03,$BD,$BE,$40,$05,$02, $01,$00,$0F,$6E,$06,$08,$DC,$03
	.db	$2C,$1C,$03,$A1,$C8,$58,$17,$00, $00,$00,$0D,$B0,$00,$2C,$F8,$02
	.db	$2C,$24,$03,$22,$C8,$58,$06,$00, $00,$00,$10,$B0,$00,$10,$30,$03
	.db	$34,$1C,$03,$20,$C8,$58,$06,$00, $00,$00,$12,$B0,$00,$38,$30,$03
	.db	$1C,$2C,$03,$A5,$C8,$58,$17,$00, $00,$00,$0D,$B0,$00,$1C,$08,$03
	.db	$1C,$34,$03,$26,$C8,$58,$03,$00, $01,$00,$11,$B0,$06,$38,$B2,$05
	.db	$14,$34,$03,$A7,$C8,$58,$02,$00, $01,$00,$11,$B0,$04,$24,$E4,$02
	.db	$FE,$B2,$02,$B6,$D0,$D8,$02,$04, $01,$0C,$11,$2C,$04,$18,$EE,$02
	.db	$FE,$FA,$02,$19,$C9,$D8,$02,$04, $01,$08,$11,$2C,$04,$30,$EE,$02
	.db	$24,$90,$04,$10,$B2,$30,$03,$04, $01,$08,$11,$42,$04,$24,$90,$04
	.db	$14,$80,$04,$10,$B4,$30,$03,$02, $01,$08,$12,$42,$02,$14,$80,$04
	.db	$3C,$64,$04,$48,$B3,$68,$1A,$00, $00,$00,$0D,$DC,$00,$3C,$64,$04
	.db	$00,$40,$04,$4B,$B9,$60,$0A,$00, $00,$00,$0D,$DC,$00,$00,$40,$04
	.db	$08,$40,$04,$CA,$B8,$60,$0A,$00, $00,$00,$0D,$DC,$00,$08,$40,$04
	.db	$3E,$A8,$04,$F0,$AE,$60,$0A,$00, $00,$04,$0D,$DC,$00,$40,$A8,$04
	.db	$46,$A8,$04,$6F,$AE,$60,$0A,$00, $00,$04,$0D,$DC,$00,$48,$A8,$04
	.db	$08,$E8,$04,$5F,$AE,$E0,$16,$00, $00,$00,$0D,$84,$00,$08,$E8,$04
	.db	$10,$F8,$04,$E0,$AC,$E0,$16,$00, $00,$00,$0D,$84,$00,$10,$F8,$04
	.db	$08,$08,$05,$63,$AC,$E0,$16,$00, $00,$00,$0D,$84,$00,$08,$08,$05
	.db	$00,$20,$05,$67,$AB,$E0,$16,$00, $00,$00,$0D,$84,$00,$00,$20,$05
	.db	$00,$40,$05,$6B,$A9,$E0,$16,$00, $00,$00,$0D,$84,$00,$00,$40,$05
	.db	$10,$58,$05,$EC,$A6,$E0,$16,$00, $00,$00,$0D,$84,$00,$10,$58,$05
	.db	$48,$F0,$04,$D8,$A9,$E0,$16,$00, $00,$00,$0D,$84,$00,$48,$F0,$04
	.db	$38,$00,$05,$DC,$A9,$E0,$16,$00, $00,$00,$0D,$84,$00,$38,$00,$05
	.db	$48,$18,$05,$5D,$A7,$E0,$16,$00, $00,$00,$0D,$84,$00,$48,$18,$05
	.db	$40,$30,$05,$61,$A6,$E0,$16,$00, $00,$00,$0D,$84,$00,$40,$30,$05
	.db	$24,$08,$07,$DF,$8A,$30,$03,$04, $01,$08,$12,$42,$04,$24,$6C,$06
	.db	$15,$11,$07,$42,$8B,$30,$03,$04, $01,$08,$12,$42,$04,$15,$61,$06
	.db	$33,$11,$07,$5E,$89,$30,$03,$04, $01,$0C,$12,$42,$04,$34,$76,$06
	.db	$06,$20,$07,$46,$8B,$30,$03,$04, $01,$04,$12,$42,$04,$06,$8A,$06
	.db	$42,$20,$07,$7E,$87,$30,$03,$04, $01,$0C,$12,$42,$04,$42,$84,$06
	.db	$08,$F8,$07,$C1,$7D,$38,$04,$00, $01,$00,$10,$58,$00,$08,$F8,$07
	.db	$38,$10,$08,$3E,$79,$38,$04,$02, $01,$00,$12,$58,$02,$38,$10,$08
	.db	$30,$00,$08,$BD,$7A,$38,$04,$04, $01,$00,$0F,$58,$04,$30,$00,$08
	.db	$20,$08,$08,$40,$7B,$38,$04,$01, $01,$00,$10,$58,$01,$20,$08,$08
	.db	$10,$20,$08,$C5,$7A,$38,$06,$01, $00,$00,$0F,$58,$00,$1C,$E4,$08
	.db	$48,$48,$05,$63,$A4,$E0,$16,$00, $00,$00,$0D,$84,$00,$48,$48,$05
	.db	$38,$60,$05,$E8,$A3,$E0,$16,$00, $00,$00,$0D,$84,$00,$38,$60,$05
	.db	$18,$38,$05,$67,$A8,$28,$02,$02, $01,$00,$11,$2C,$02,$18,$38,$05
	.db	$28,$20,$05,$E2,$A8,$28,$02,$06, $01,$00,$11,$2C,$06,$28,$20,$05
	.db	$1C,$EC,$05,$FD,$9C,$60,$0A,$00, $00,$00,$0D,$DC,$00,$1C,$EC,$05
	.db	$2C,$EC,$05,$FB,$9B,$60,$0A,$00, $00,$00,$0D,$DC,$00,$2C,$EC,$05
	.db	$24,$F4,$05,$FD,$9B,$68,$1A,$00, $00,$00,$0D,$DC,$00,$24,$F4,$05
	.db	$24,$EC,$05,$7C,$9C,$40,$05,$06, $01,$00,$10,$6E,$06,$24,$EC,$05
	.db	$34,$28,$08,$01,$78,$38,$04,$01, $02,$08,$0F,$58,$01,$34,$28,$08
	.db	$1C,$14,$08,$C2,$7A,$38,$04,$07, $02,$00,$10,$58,$07,$1C,$14,$08
	.db	$00,$70,$07,$B1,$86,$E0,$06,$00, $00,$00,$10,$84,$00,$10,$70,$07
	.db	$08,$70,$07,$30,$86,$E0,$06,$00, $00,$00,$12,$84,$00,$38,$70,$07
	.db	$10,$78,$07,$30,$85,$E0,$16,$00, $00,$00,$0D,$84,$00,$10,$78,$07
	.db	$10,$80,$07,$B1,$84,$E0,$16,$00, $00,$00,$0D,$84,$00,$10,$80,$07
	.db	$48,$70,$07,$28,$82,$E0,$16,$00, $00,$00,$0D,$84,$00,$48,$70,$07
	.db	$40,$70,$07,$A9,$82,$E0,$16,$00, $00,$00,$0D,$84,$00,$40,$70,$07
	.db	$38,$78,$07,$AB,$82,$E0,$16,$00, $00,$00,$0D,$84,$00,$38,$78,$07
	.db	$38,$80,$07,$2C,$82,$E0,$16,$00, $00,$00,$0D,$84,$00,$38,$80,$07
	.db	$10,$70,$07,$AF,$85,$48,$16,$00, $00,$00,$0D,$84,$00,$00,$70,$07
	.db	$38,$70,$07,$2A,$83,$48,$16,$00, $00,$00,$0D,$84,$00,$08,$70,$07
	.db	$26,$28,$07,$C3,$88,$68,$1A,$00, $00,$04,$0D,$DC,$00,$26,$28,$07
	.db	$1E,$38,$07,$46,$88,$68,$1A,$00, $00,$04,$0D,$DC,$00,$1E,$38,$07
	.db	$14,$3A,$07,$C7,$88,$68,$1A,$00, $00,$0C,$0D,$DC,$00,$14,$3A,$07
	.db	$34,$44,$07,$25,$86,$68,$1A,$00, $00,$00,$0D,$DC,$00,$34,$44,$07
	.db	$10,$78,$08,$50,$75,$38,$04,$03, $02,$00,$12,$58,$03,$10,$78,$08
	.db	$30,$70,$08,$CB,$73,$38,$04,$04, $02,$00,$11,$58,$04,$30,$70,$08
	.db	$28,$86,$08,$EE,$72,$38,$04,$03, $02,$0C,$10,$58,$03,$28,$86,$08
	.db	$38,$20,$09,$60,$68,$E8,$06,$00, $00,$00,$10,$B0,$00,$2C,$E4,$08
	.db	$40,$20,$09,$DF,$67,$E8,$08,$00, $00,$00,$0D,$B0,$00,$24,$E0,$08
	.db	$48,$20,$09,$5E,$67,$E8,$08,$00, $00,$00,$0D,$B0,$00,$24,$E8,$08
	.db	$12,$36,$09,$67,$69,$68,$1A,$00, $00,$08,$0D,$DC,$00,$12,$36,$09
	.db	$32,$66,$09,$69,$64,$68,$1A,$00, $00,$08,$0D,$DC,$00,$32,$66,$09
	.db	$30,$54,$09,$A7,$65,$40,$05,$06, $01,$08,$10,$6E,$06,$30,$54,$09
	.db	$16,$54,$09,$4A,$67,$40,$05,$02, $01,$0C,$10,$6E,$02,$16,$54,$09
	.db	$30,$E0,$09,$F9,$5C,$60,$0A,$00, $00,$00,$0D,$DC,$00,$30,$E0,$09
	.db	$10,$20,$0A,$05,$5B,$60,$0A,$00, $00,$00,$0D,$DC,$00,$10,$20,$0A
	.db	$08,$28,$0A,$07,$5B,$60,$0A,$00, $00,$00,$0D,$DC,$00,$08,$28,$0A
	.db	$28,$F0,$09,$7C,$5C,$40,$05,$02, $01,$00,$10,$6E,$02,$28,$F0,$09
	.db	$22,$FE,$09,$FE,$5B,$40,$05,$02, $01,$08,$10,$6E,$02,$22,$FE,$09
	.db	$1C,$0C,$0A,$81,$5B,$40,$05,$02, $01,$00,$10,$6E,$02,$1C,$0C,$0A
	.db	$24,$B4,$0A,$95,$50,$60,$0A,$00, $00,$00,$0D,$DC,$00,$24,$B4,$0A
	.db	$1C,$BC,$0A,$97,$50,$60,$0A,$00, $00,$00,$0D,$DC,$00,$1C,$BC,$0A
	.db	$2C,$BC,$0A,$95,$4F,$60,$0A,$00, $00,$00,$0D,$DC,$00,$2C,$BC,$0A
	.db	$24,$C4,$0A,$97,$4F,$60,$0A,$00, $00,$00,$0D,$DC,$00,$24,$C4,$0A
	.db	$24,$BC,$0A,$16,$50,$78,$13,$06, $02,$00,$12,$42,$06,$24,$BC,$0A
	.db	$00,$20,$0B,$27,$4C,$E0,$06,$00, $00,$00,$11,$84,$00,$10,$30,$0B
	.db	$08,$28,$0B,$27,$4B,$E0,$06,$00, $00,$00,$10,$84,$00,$38,$30,$0B
	.db	$10,$30,$0B,$27,$4A,$E0,$16,$00, $00,$00,$0D,$84,$00,$00,$20,$0B
	.db	$48,$20,$0B,$9E,$47,$E0,$16,$00, $00,$00,$0D,$84,$00,$48,$20,$0B
	.db	$40,$28,$0B,$A0,$47,$E0,$16,$00, $00,$00,$0D,$84,$00,$40,$28,$0B
	.db	$38,$30,$0B,$A2,$47,$E0,$16,$00, $00,$00,$0D,$84,$00,$08,$28,$0B
	.db	$08,$A0,$0B,$B6,$43,$78,$13,$04, $01,$00,$13,$42,$02,$18,$F6,$0B
	.db	$18,$A0,$0B,$B4,$42,$78,$13,$04, $02,$00,$13,$42,$04,$28,$F6,$0B
	.db	$30,$A0,$0B,$31,$41,$78,$13,$04, $01,$00,$13,$42,$06,$38,$F6,$0B
	.db	$40,$A0,$0B,$2F,$40,$78,$13,$04, $02,$00,$13,$42,$02,$10,$10,$0C
	.db	$10,$D0,$0B,$3B,$40,$78,$13,$04, $02,$00,$13,$42,$00,$20,$10,$0C
	.db	$08,$E0,$0B,$BE,$3F,$78,$13,$04, $02,$00,$13,$42,$06,$30,$10,$0C
	.db	$38,$D0,$0B,$B6,$3D,$78,$17,$04, $00,$00,$0D,$42,$00,$10,$D8,$0B
	.db	$40,$E0,$0B,$37,$3C,$78,$17,$04, $00,$00,$0D,$42,$00,$30,$D0,$0B
	.db	$18,$28,$0C,$45,$3A,$E0,$17,$00, $00,$00,$0D,$84,$00,$18,$28,$0C
	.db	$30,$28,$0C,$C2,$38,$E0,$17,$00, $00,$00,$0D,$84,$00,$30,$28,$0C
	.db	$20,$28,$0C,$C4,$39,$E8,$17,$00, $00,$00,$0D,$B0,$00,$04,$FC,$0B
	.db	$28,$28,$0C,$43,$39,$E8,$17,$00, $00,$00,$0D,$B0,$00,$44,$0C,$0C
	.db	$28,$DE,$0E,$39,$0E,$60,$0A,$00, $00,$0C,$0D,$DC,$00,$28,$DE,$0E
	.db	$1E,$EA,$0E,$1C,$0E,$60,$0A,$00, $00,$08,$0D,$DC,$00,$1E,$EA,$0E
	.db	$06,$E8,$0E,$BF,$0F,$60,$0A,$00, $00,$04,$0D,$DC,$00,$06,$E8,$0E
	.db	$34,$E4,$0E,$19,$0D,$60,$0A,$00, $00,$00,$0D,$DC,$00,$34,$E4,$0E
	.db	$44,$F0,$0E,$58,$0B,$60,$0A,$00, $00,$08,$0D,$DC,$00,$44,$F0,$0E
	.db	$10,$E8,$0E,$1E,$0F,$60,$0A,$00, $00,$00,$0D,$DC,$00,$10,$E8,$0E
	.db	$42,$6A,$0F,$E8,$03,$68,$03,$00, $02,$00,$10,$DC,$04,$20,$3A,$11
	.db	$32,$6E,$0F,$AA,$04,$68,$1A,$00, $00,$08,$0D,$DC,$00,$32,$6E,$0F
	.db	$3A,$82,$0F,$EC,$02,$68,$1A,$00, $00,$00,$0D,$DC,$00,$3A,$82,$0F
	.db	$3A,$90,$0F,$0D,$02,$68,$1A,$00, $00,$0C,$0D,$DC,$00,$3A,$90,$0F
	.db	$38,$0C,$10,$7D,$FA,$40,$05,$06, $01,$08,$10,$6E,$06,$38,$0C,$10
	.db	$38,$1C,$10,$7F,$F9,$40,$05,$06, $01,$08,$10,$6E,$06,$38,$1C,$10
	.db	$10,$2C,$10,$06,$FB,$40,$05,$02, $01,$08,$10,$6E,$02,$10,$2C,$10
	.db	$10,$3C,$10,$08,$FA,$40,$05,$02, $01,$08,$10,$6E,$02,$10,$3C,$10
	.db	$04,$90,$0C,$14,$35,$68,$1A,$00, $00,$08,$0D,$DC,$00,$04,$88,$0C
	.db	$0C,$CE,$0C,$BB,$30,$68,$1A,$00, $00,$04,$0D,$DC,$00,$0E,$CE,$0C
	.db	$08,$DA,$0C,$3D,$30,$68,$1A,$00, $00,$04,$0D,$DC,$00,$12,$DA,$0C
	.db	$24,$70,$0D,$2C,$25,$40,$05,$06, $01,$08,$10,$6E,$06,$24,$70,$0D
	.db	$2C,$68,$0D,$2A,$25,$40,$05,$05, $01,$08,$10,$6E,$05,$2C,$68,$0D
	.db	$1C,$68,$0D,$2C,$26,$40,$05,$03, $01,$08,$10,$6E,$03,$1C,$68,$0D
	.db	$00,$7A,$0E,$F2,$16,$38,$04,$01, $01,$04,$10,$58,$01,$00,$7A,$0E
	.db	$48,$7A,$0E,$69,$12,$38,$04,$07, $01,$04,$12,$58,$07,$48,$7A,$0E
	.db	$1A,$98,$0E,$72,$13,$28,$02,$04, $02,$0C,$12,$2C,$04,$1A,$98,$0E
	.db	$2E,$98,$0E,$30,$12,$28,$02,$04, $02,$04,$12,$2C,$04,$2E,$98,$0E
	.db	$12,$A2,$0E,$55,$13,$30,$03,$04, $01,$00,$10,$42,$04,$12,$A2,$0E
	.db	$3A,$A2,$0E,$D0,$10,$30,$03,$04, $01,$00,$10,$42,$04,$3A,$A2,$0E
	.db	$28,$DC,$10,$99,$EE,$60,$0A,$00, $00,$08,$0D,$DC,$00,$28,$DC,$10
	.db	$20,$E4,$10,$9B,$EE,$60,$05,$00, $01,$08,$10,$DC,$05,$20,$E4,$10
	.db	$18,$EC,$10,$9D,$EE,$60,$0A,$00, $00,$08,$0D,$DC,$00,$18,$EC,$10
	.db	$20,$F4,$10,$9D,$ED,$60,$0A,$00, $00,$08,$0D,$DC,$00,$20,$F4,$10
	.db	$28,$EC,$10,$9B,$ED,$60,$05,$00, $01,$08,$10,$DC,$01,$28,$EC,$10
	.db	$30,$E4,$10,$99,$ED,$60,$0A,$00, $00,$08,$0D,$DC,$00,$30,$E4,$10
	.db	$28,$E4,$10,$1A,$EE,$28,$02,$00, $02,$08,$11,$2C,$00,$28,$E4,$10
	.db	$20,$EC,$10,$1C,$EE,$28,$02,$00, $02,$08,$11,$2C,$00,$20,$EC,$10
	.db	$24,$4A,$13,$47,$C8,$78,$13,$04, $02,$0C,$13,$42,$04,$24,$4A,$13
	.db	$10,$70,$13,$2F,$C7,$78,$13,$04, $02,$00,$13,$42,$04,$10,$70,$13
	.db	$08,$86,$13,$52,$C6,$78,$13,$04, $02,$0C,$13,$42,$04,$08,$86,$13
	.db	$38,$70,$13,$AA,$C4,$78,$13,$04, $02,$00,$13,$42,$04,$38,$70,$13
	.db	$40,$86,$13,$CB,$C2,$78,$13,$04, $02,$0C,$13,$42,$04,$40,$86,$13
	.db	$08,$00,$13,$A2,$CE,$48,$06,$00, $00,$00,$0F,$84,$00,$08,$00,$13
	.db	$10,$08,$13,$A2,$CD,$48,$06,$00, $00,$00,$10,$84,$00,$10,$08,$13
	.db	$38,$08,$13,$1D,$CB,$48,$06,$00, $00,$00,$12,$84,$00,$38,$08,$13
	.db	$40,$00,$13,$1B,$CB,$48,$06,$00, $00,$00,$10,$84,$00,$40,$00,$13
	.db	$00,$D8,$11,$7E,$E1,$E0,$06,$00, $00,$00,$11,$84,$00,$00,$D8,$11
	.db	$18,$C0,$11,$78,$E1,$E0,$16,$00, $00,$00,$0D,$84,$00,$18,$C0,$11
	.db	$18,$C8,$11,$F9,$E0,$E0,$16,$00, $00,$00,$0D,$84,$00,$18,$C8,$11
	.db	$10,$C8,$11,$7A,$E1,$E0,$16,$00, $00,$00,$0D,$84,$00,$10,$C8,$11
	.db	$48,$D8,$11,$F5,$DC,$E0,$06,$00, $00,$00,$10,$84,$00,$48,$D8,$11
	.db	$30,$C0,$11,$F5,$DF,$E0,$16,$00, $00,$00,$0D,$84,$00,$30,$C0,$11
	.db	$30,$C8,$11,$76,$DF,$E0,$16,$00, $00,$00,$0D,$84,$00,$30,$C8,$11
	.db	$38,$C8,$11,$F5,$DE,$E0,$16,$00, $00,$00,$0D,$84,$00,$38,$C8,$11
	.db	$10,$E8,$11,$7E,$DF,$E0,$16,$00, $00,$00,$0D,$84,$00,$10,$E8,$11
	.db	$18,$E8,$11,$FD,$DE,$E0,$16,$00, $00,$00,$0D,$84,$00,$18,$E8,$11
	.db	$18,$F0,$11,$7E,$DE,$E0,$16,$00, $00,$00,$0D,$84,$00,$18,$F0,$11
	.db	$30,$E8,$11,$7A,$DD,$E0,$16,$00, $00,$00,$0D,$84,$00,$30,$E8,$11
	.db	$38,$E8,$11,$F9,$DC,$E0,$16,$00, $00,$00,$0D,$84,$00,$38,$E8,$11
	.db	$30,$F0,$11,$FB,$DC,$E0,$16,$00, $00,$00,$0D,$84,$00,$30,$F0,$11
	.db	$14,$48,$12,$49,$D9,$50,$07,$00, $00,$08,$0D,$9A,$00,$10,$48,$12
	.db	$34,$48,$12,$45,$D7,$50,$07,$00, $00,$08,$0D,$9A,$00,$3C,$48,$12
	.db	$24,$48,$12,$47,$D8,$40,$05,$02, $02,$08,$10,$6E,$02,$24,$48,$12
	.db	$20,$58,$11,$6A,$E7,$30,$03,$04, $02,$00,$12,$42,$04,$20,$58,$11
	.db	$30,$A8,$11,$72,$E1,$30,$03,$00, $02,$00,$11,$42,$00,$30,$A8,$11
	.db	$18,$90,$11,$72,$E4,$38,$04,$01, $02,$00,$10,$58,$01,$18,$90,$11
	.db	$38,$78,$11,$EB,$E3,$38,$04,$00, $02,$00,$12,$58,$00,$38,$78,$11
	.db	$3A,$DE,$14,$D7,$AD,$68,$1A,$00, $00,$08,$0D,$DC,$00,$3A,$DE,$14
	.db	$3C,$F0,$14,$99,$AC,$68,$1A,$00, $00,$08,$0D,$DC,$00,$3C,$F0,$14
	.db	$28,$FC,$14,$1D,$AD,$68,$1A,$00, $00,$08,$0D,$DC,$00,$28,$FC,$14
	.db	$FE,$00,$00,$00,$00,$00,$1A,$00, $00,$00,$0D,$00,$00,$02,$50,$13
	.db	$FE,$00,$00,$00,$00,$00,$05,$00, $01,$00,$10,$00,$01,$38,$28,$14
	.db	$FE,$00,$00,$00,$00,$00,$05,$00, $01,$00,$10,$00,$03,$28,$36,$14
	.db	$FE,$00,$00,$00,$00,$00,$05,$00, $01,$00,$10,$00,$02,$20,$40,$14
	.db	$FE,$00,$00,$00,$00,$00,$05,$00, $01,$00,$10,$00,$05,$18,$5A,$14
	.db	$FE,$00,$00,$00,$00,$00,$05,$00, $01,$00,$10,$00,$07,$3C,$5E,$14
	.db	$FE,$00,$00,$00,$00,$00,$05,$00, $01,$00,$10,$00,$02,$48,$4E,$14
	.db	$FE,$00,$00,$00,$00,$00,$13,$00, $02,$00,$13,$00,$04,$24,$5A,$15
	.db	$FE,$00,$00,$00,$00,$00,$13,$00, $02,$00,$13,$00,$04,$08,$64,$15
	.db	$FE,$00,$00,$00,$00,$00,$13,$00, $02,$00,$13,$00,$04,$18,$64,$15
	.db	$FE,$00,$00,$00,$00,$00,$13,$00, $02,$00,$13,$00,$04,$30,$64,$15
	.db	$FE,$00,$00,$00,$00,$00,$13,$00, $02,$00,$13,$00,$04,$40,$64,$15
	.db	$FE,$00,$00,$00,$00,$00,$1A,$00, $00,$00,$0D,$00,$00,$3C,$CC,$13
	.db	$FE,$00,$00,$00,$00,$00,$02,$00, $01,$00,$12,$00,$06,$24,$08,$05
	.db	$FE,$00,$00,$00,$00,$00,$02,$00, $01,$00,$12,$00,$02,$24,$2E,$05
	.db	$FE,$00,$00,$00,$00,$00,$06,$00, $00,$00,$10,$00,$00,$08,$78,$06
	.db	$FE,$00,$00,$00,$00,$00,$06,$00, $00,$00,$11,$00,$00,$48,$A8,$06
	.db	$FE,$00,$00,$00,$00,$00,$08,$00, $00,$00,$0D,$00,$00,$10,$78,$06
	.db	$FE,$00,$00,$00,$00,$00,$04,$00, $02,$00,$10,$00,$00,$10,$E8,$0F
	.db	$FE,$00,$00,$00,$00,$00,$04,$00, $02,$00,$0F,$00,$00,$26,$E8,$0F
	.db	$FE,$00,$00,$00,$00,$00,$04,$00, $02,$00,$12,$00,$03,$40,$E8,$0F
	.db	$FE,$00,$00,$00,$00,$00,$02,$00, $02,$00,$12,$00,$04,$00,$C8,$12
	.db	$FE,$00,$00,$00,$00,$00,$02,$00, $02,$00,$12,$00,$04,$00,$B8,$12
	.db	$FE,$00,$00,$00,$00,$00,$02,$00, $02,$00,$12,$00,$04,$00,$A8,$12
	.db	$FE,$00,$00,$00,$00,$00,$02,$00, $02,$00,$12,$00,$04,$48,$C8,$12
	.db	$FE,$00,$00,$00,$00,$00,$02,$00, $02,$00,$12,$00,$04,$48,$B8,$12
	.db	$FE,$00,$00,$00,$00,$00,$02,$00, $02,$00,$12,$00,$04,$48,$A8,$12
	.db	$FE,$00,$00,$00,$00,$00,$08,$00, $00,$00,$0D,$00,$00,$00,$00,$0E
	.db	$FE,$00,$00,$00,$00,$00,$08,$00, $00,$00,$0D,$00,$00,$08,$00,$0E
	.db	$FE,$00,$00,$00,$00,$00,$08,$00, $00,$00,$0D,$00,$00,$40,$38,$0E
	.db	$FE,$00,$00,$00,$00,$00,$08,$00, $00,$00,$0D,$00,$00,$48,$38,$0E
	.db	$FE,$38,$06,$00,$00,$E0,$16,$00, $00,$00,$0D,$84,$00,$40,$88,$0C
	.db	$FE,$C0,$06,$00,$00,$E0,$16,$00, $00,$00,$0D,$84,$00,$08,$98,$0C
	.db	$FE,$A8,$06,$00,$00,$E0,$16,$00, $00,$00,$0D,$84,$00,$00,$A0,$0C
	.db	$FE,$A0,$06,$00,$00,$E0,$16,$00, $00,$00,$0D,$84,$00,$10,$C0,$0C
	.db	$FE,$78,$06,$00,$00,$E0,$16,$00, $00,$00,$0D,$84,$00,$08,$E0,$0C
	.db	$FE,$58,$06,$00,$00,$E0,$16,$00, $00,$00,$0D,$84,$00,$48,$E8,$0C
	.db	$FE,$68,$06,$00,$00,$E0,$16,$00, $00,$00,$0D,$84,$00,$30,$C8,$0C
	.db	$FE,$40,$06,$00,$00,$E0,$16,$00, $00,$00,$0D,$84,$00,$38,$B0,$0C
	.db	$06,$1E,$16,$46,$9D,$F8,$06,$00, $00,$00,$11,$9A,$00,$06,$82,$15
	.db	$15,$1E,$16,$64,$9C,$F8,$06,$00, $00,$00,$0F,$9A,$00,$15,$83,$15
	.db	$24,$1E,$16,$62,$9B,$F8,$06,$00, $00,$04,$12,$9A,$00,$24,$7A,$15
	.db	$33,$1E,$16,$80,$9A,$F8,$06,$00, $00,$04,$10,$9A,$00,$33,$83,$15
	.db	$42,$1E,$16,$7E,$99,$F8,$06,$00, $00,$08,$11,$9A,$00,$42,$82,$15
	.db	$28,$8C,$15,$2F,$A4,$28,$15,$02, $01,$08,$12,$6E,$02,$28,$8C,$15
	.db	$06,$82,$15,$F2,$A6,$48,$19,$00, $00,$08,$0D,$84,$00,$06,$82,$15
	.db	$15,$83,$15,$F0,$A5,$48,$19,$00, $00,$0C,$0D,$84,$00,$15,$83,$15
	.db	$24,$82,$15,$0E,$A5,$48,$19,$00, $00,$0C,$0D,$84,$00,$24,$82,$15
	.db	$33,$83,$15,$0D,$A4,$48,$19,$00, $00,$00,$0D,$84,$00,$33,$83,$15
	.db	$42,$82,$15,$2B,$A3,$48,$19,$00, $00,$00,$0D,$84,$00,$42,$82,$15
	.db	$28,$FC,$15,$3D,$9D,$28,$15,$06, $01,$08,$12,$6E,$06,$28,$FC,$15
	.db	$06,$98,$00,$F5,$F2,$F8,$19,$00, $00,$04,$0D,$9A,$00,$06,$98,$00
	.db	$12,$98,$00,$33,$F2,$F8,$19,$00, $00,$0C,$0D,$9A,$00,$12,$98,$00
	.db	$1E,$98,$00,$72,$F1,$F8,$19,$00, $00,$04,$0D,$9A,$00,$1E,$98,$00
	.db	$2A,$98,$00,$B0,$F0,$F8,$19,$00, $00,$0C,$0D,$9A,$00,$2A,$98,$00
	.db	$36,$98,$00,$EF,$EF,$F8,$19,$00, $00,$04,$0D,$9A,$00,$36,$98,$00
	.db	$42,$98,$00,$2D,$EF,$F8,$19,$00, $00,$0C,$0D,$9A,$00,$42,$98,$00
	.db	$1C,$A8,$03,$F4,$C0,$00,$00,$05, $00,$08,$0E,$00,$00,$24,$B0,$00
	.db	$24,$98,$03,$71,$C1,$70,$10,$00, $01,$08,$0D,$00,$00,$18,$58,$00
	.db	$24,$A0,$03,$F2,$C0,$70,$10,$00, $01,$08,$0D,$00,$00,$30,$64,$00
	.db	$24,$A8,$03,$73,$C0,$70,$10,$00, $01,$08,$0D,$00,$00,$18,$70,$00
	.db	$24,$B0,$03,$F4,$BF,$70,$10,$00, $01,$08,$0D,$00,$00,$30,$7C,$00
	.db	$24,$B8,$03,$75,$BF,$10,$09,$00, $00,$08,$0D,$C6,$00,$24,$C0,$00
	.db	$FE,$79,$02,$4D,$D3,$18,$01,$00, $04,$0C,$11,$16,$00,$FE,$B0,$00
	.db	$FE,$CE,$03,$5C,$C0,$18,$01,$00, $04,$0C,$12,$16,$00,$FE,$B0,$00
	.db	$FE,$D2,$03,$1D,$C0,$18,$01,$00, $04,$04,$11,$16,$00,$FE,$B0,$00

; adresy struktur Vortonov, Lasertronu a troch striel
SprListVL:	.equ	SprList+(240*16)
SprStructV1	.equ	SprListVL+00h
SprStructV2	.equ	SprListVL+10h
SprStructV3	.equ	SprListVL+20h
SprStructV4	.equ	SprListVL+30h
SprStructV5	.equ	SprListVL+40h
SprStructLT	.equ	SprListVL+50h
SprStructS1	.equ	SprListVL+60h
SprStructS2	.equ	SprListVL+70h
SprStructS3	.equ	SprListVL+80h

;------------------------------------------------------------------------------
; zoznam pripravenych a aktivnych struktur spritov - MUSI nasledovat za SprList!
SprPrepList:	.ds	(44*16)+2

;------------------------------------------------------------------------------
; zoznam ukazatelov prekreslovanych spritov zoradeny podla izometrickej hlbky
SprListOrd:	.ds	(44*3)+2

;------------------------------------------------------------------------------
; Font 8x5 - 43 znakov - font je bitovo otoceny
; Znaky: 0 1 2 3 4 5 6 7 8 9 SP : / . - ? !
;        A B C D E F G H I J K L M N O P Q R S T U V W X Y Z
Font85:		;binclude "../data/font85.bin"
	.db	$41,$5D,$5D,$5D,$41	; 000 0
	.db	$7D,$7D,$7D,$7D,$7D	; 001 1
	.db	$41,$7D,$41,$5F,$41	; 002 2
	.db	$41,$7D,$41,$7D,$41	; 003 3
	.db	$5D,$5D,$41,$7D,$7D	; 004 4
	.db	$41,$5F,$41,$7D,$41	; 005 5
	.db	$41,$5F,$41,$5D,$41	; 006 6
	.db	$41,$7D,$7D,$7D,$7D	; 007 7
	.db	$41,$5D,$41,$5D,$41	; 010 8
	.db	$41,$5D,$41,$7D,$41	; 011 9
	.db	$7F,$7F,$7F,$7F,$7F	; 012  
	.db	$7F,$6F,$7F,$6F,$7F	; 013 :
	.db	$7D,$7B,$77,$6F,$5F	; 014 /
	.db	$7F,$7F,$77,$7F,$7F	; 015 .
	.db	$7F,$7F,$63,$7F,$7F	; 016 -
	.db	$63,$7B,$73,$7F,$77	; 017 ?
	.db	$77,$77,$77,$7F,$77	; 020 !
	.db	$63,$5D,$5D,$41,$5D	; 021 A
	.db	$43,$5D,$43,$5D,$43	; 022 B
	.db	$61,$5F,$5F,$5F,$61	; 023 C
	.db	$43,$5D,$5D,$5D,$43	; 024 D
	.db	$41,$5F,$41,$5F,$41	; 025 E
	.db	$41,$5F,$41,$5F,$5F	; 026 F
	.db	$61,$5F,$5D,$5D,$61	; 027 G
	.db	$5D,$5D,$41,$5D,$5D	; 030 H
	.db	$63,$77,$77,$77,$63	; 031 I
	.db	$7D,$7D,$7D,$5D,$63	; 032 J
	.db	$5D,$5B,$47,$5B,$5D	; 033 K
	.db	$5F,$5F,$5F,$5F,$41	; 034 L
	.db	$6B,$55,$55,$55,$55	; 035 M
	.db	$5D,$4D,$55,$59,$5D	; 036 N
	.db	$63,$5D,$5D,$5D,$63	; 037 O
	.db	$43,$5D,$43,$5F,$5F	; 040 P
	.db	$63,$5D,$5D,$59,$61	; 041 Q
	.db	$43,$5D,$43,$5B,$5D	; 042 R
	.db	$63,$5F,$63,$7D,$43	; 043 S
	.db	$41,$77,$77,$77,$77	; 044 T
	.db	$5D,$5D,$5D,$5D,$63	; 045 U
	.db	$5D,$5D,$5D,$6B,$77	; 046 V
	.db	$55,$55,$55,$55,$6B	; 047 W
	.db	$5D,$6B,$77,$6B,$5D	; 050 X
	.db	$5D,$6B,$77,$77,$77	; 051 Y
	.db	$41,$7B,$77,$6F,$41	; 052 Z

; Font 4x5 - v jednej predlohe su dva znaky siroke 4 body. - 32 znakov
; Znaky: < = > ? @ A B C D E F G H I J K L M N O P Q R S T U V W X Y Z .
Font4:		;binclude "../data/font4.bin"
	.db	$08,$04,$3E,$04,$08,$08,$08,$3E	
	.db	$08,$08,$02,$05,$05,$07,$05,$62	
	.db	$55,$64,$55,$62,$67,$54,$56,$54	
	.db	$67,$72,$45,$64,$45,$43,$52,$52	
	.db	$72,$52,$52,$25,$25,$26,$A5,$45	
	.db	$45,$47,$45,$45,$75,$62,$55,$55	
	.db	$55,$52,$62,$55,$65,$45,$43,$63	
	.db	$54,$62,$51,$56,$75,$25,$25,$25	
	.db	$23,$55,$55,$55,$57,$25,$55,$55	
	.db	$22,$52,$52,$70,$10,$22,$40,$70

; Font 8x8 - font je bitovo otoceny
Font88:
; цифры - 21 символ
		;binclude "../data/font-digits.bin"
	.db	$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$00,$3F,$5F,$6F,$70,$70,$70
	.db	$00,$00,$3F,$1F,$0F,$00,$00,$00
	.db	$00,$00,$00,$40,$60,$70,$70,$70
	.db	$00,$00,$FC,$FA,$F6,$0E,$0E,$0E
	.db	$00,$00,$FC,$F8,$F0,$00,$00,$00
	.db	$00,$00,$00,$02,$06,$0E,$0E,$0E
	.db	$70,$70,$60,$5F,$3F,$5F,$60,$70
	.db	$70,$70,$60,$40,$00,$40,$60,$70
	.db	$70,$70,$60,$5F,$3F,$1F,$00,$00
	.db	$00,$00,$00,$1F,$3F,$5F,$60,$70
	.db	$00,$00,$00,$1F,$3F,$1F,$00,$00
	.db	$0E,$0E,$06,$FA,$FC,$FA,$06,$0E
	.db	$0E,$0E,$06,$FA,$FC,$F8,$00,$00
	.db	$00,$00,$00,$F8,$FC,$FA,$06,$0E
	.db	$0E,$0E,$06,$02,$00,$02,$06,$0E
	.db	$70,$70,$70,$70,$70,$6F,$5F,$3F
	.db	$00,$00,$00,$00,$00,$0F,$1F,$3F
	.db	$0E,$0E,$0E,$0E,$0E,$F6,$FA,$FC
	.db	$0E,$0E,$0E,$0E,$0E,$06,$02,$00
	.db	$00,$00,$00,$00,$00,$F0,$F8,$FC
; znaky pre POWER (21 - 24) a TIME - (25 a 26)
		;binclude "../data/font-power-time.bin"
	.db	$00,$FE,$FE,$FE,$FE,$FE,$00,$FE
	.db	$00,$AA,$55,$AA,$54,$A0,$0E,$FE
	.db	$00,$AA,$54,$A0,$0E,$FE,$FE,$FE
	.db	$00,$A0,$0E,$FE,$FE,$FE,$FE,$FE
	.db	$00,$EE,$EE,$EE,$EE,$EE,$EE,$EE		; Time bars
; znaky pre ARROW (27 a 28) a VORTON HEAD - (29 a 30)
		;binclude "../data/font-arrow-vorton.bin"
;TODO

;------------------------------------------------------------------------------
; logo Vortex v hlavnej obrazovke
LogoVortex:	;binclude "../data/vortex.bin"
	.db	$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$80,$00,$00,$00,$00,$00,$00,$01
	.db	$80,$00,$00,$00,$00,$00,$00,$01,$80,$00,$00,$00,$00,$00,$00,$01
	.db	$BF,$FF,$FF,$FF,$FF,$FF,$FF,$F9,$B0,$00,$00,$00,$00,$00,$00,$19
	.db	$99,$FF,$F8,$FF,$FF,$FF,$FF,$31,$8D,$FF,$F8,$EF,$FF,$FF,$FF,$61
	.db	$86,$E0,$01,$E0,$00,$00,$04,$C1,$82,$77,$F1,$DF,$F3,$BF,$1C,$F1
	.db	$82,$70,$03,$C0,$03,$80,$71,$D1,$82,$77,$E3,$BF,$F3,$A7,$B1,$D1
	.db	$82,$70,$07,$80,$03,$8F,$FB,$B1,$82,$77,$C7,$78,$0B,$BF,$FB,$A1
	.db	$82,$70,$0F,$03,$DF,$FC,$FF,$61,$82,$77,$8F,$31,$FF,$F8,$EF,$41
	.db	$82,$74,$1F,$F9,$FF,$F9,$CE,$C1,$82,$77,$1F,$F1,$F7,$BF,$DE,$C1
	.db	$82,$72,$3D,$F9,$E3,$BF,$9F,$41,$82,$72,$3B,$FD,$F3,$BE,$3F,$61
	.db	$82,$74,$7F,$9F,$C3,$B8,$3B,$A1,$82,$74,$7F,$CF,$F3,$9C,$71,$B1
	.db	$82,$74,$FE,$0F,$C3,$9F,$F1,$D1,$82,$70,$FF,$CF,$F3,$9F,$EC,$D9
	.db	$82,$71,$FC,$0F,$C3,$C7,$A0,$F1,$82,$71,$DF,$1D,$C1,$FF,$FF,$E1
	.db	$82,$73,$DC,$1D,$CF,$FF,$FF,$C1,$82,$73,$9E,$79,$FF,$FF,$00,$C1
	.db	$82,$77,$9F,$F7,$FF,$80,$FF,$81,$82,$77,$6F,$FF,$F8,$6F,$FC,$01
	.db	$82,$7F,$40,$00,$00,$00,$06,$01,$82,$7E,$BF,$FF,$FF,$FF,$FB,$01
	.db	$82,$7E,$67,$31,$16,$D9,$8D,$01,$82,$7C,$62,$D3,$B6,$AA,$9D,$01
	.db	$82,$7C,$7A,$D7,$B0,$89,$BD,$01,$82,$78,$63,$37,$B9,$AA,$8D,$01
	.db	$83,$79,$BF,$FF,$FF,$FF,$FB,$01,$81,$F3,$C0,$00,$00,$00,$06,$01
	.db	$80,$7F,$CF,$7F,$FD,$FF,$FC,$01,$80,$1F,$B9,$B0,$1B,$00,$00,$01
	.db	$80,$0F,$60,$BF,$FA,$00,$00,$01,$80,$06,$C0,$D8,$36,$00,$00,$01
	.db	$80,$03,$80,$5F,$F4,$00,$00,$01,$80,$01,$00,$6C,$6C,$00,$00,$01
	.db	$80,$00,$00,$37,$D8,$00,$00,$01,$80,$00,$00,$16,$D0,$00,$00,$01
	.db	$80,$00,$00,$1B,$B0,$00,$00,$01,$80,$00,$00,$0B,$A0,$00,$00,$01
	.db	$80,$00,$00,$0D,$60,$00,$00,$01,$80,$00,$00,$05,$40,$00,$00,$01
	.db	$80,$00,$00,$06,$C0,$00,$00,$01,$80,$00,$00,$02,$80,$00,$00,$01
	.db	$80,$00,$00,$03,$80,$00,$00,$01,$80,$00,$00,$01,$00,$00,$00,$01
	.db	$80,$00,$00,$00,$00,$00,$00,$01,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF

; data pre nakreslenie mriezky (data nesmu prekrocit hranicu MOD 256)
Grid:		;binclude "../data/grid.bin"
	.db	$40,$02,$40,$02,$40,$02,$40,$02
	.db	$10,$08,$10,$08,$10,$08,$10,$08
	.db	$04,$20,$04,$20,$04,$20,$04,$20
	.db	$01,$80,$01,$80,$01,$80,$01,$80
	.db	$02,$40,$02,$40,$02,$40,$02,$40
	.db	$08,$10,$08,$10,$08,$10,$08,$10
	.db	$20,$04,$20,$04,$20,$04,$20,$04
	.db	$80,$01,$80,$01,$80,$01,$80,$01

; Спрайт панель индикаторов
GamePanel:	;binclude "../data/panel.bin"
	.db	$03,$FF,$FF,$FF,$FF,$C3,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF
	.db	$FF,$FF,$C3,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$C0
	.db	$02,$00,$00,$00,$00,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$00,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$40
	.db	$02,$00,$00,$00,$00,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$00,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$40
	.db	$02,$07,$DF,$45,$F0,$42,$00,$20,$03,$E0,$03,$E0,$02,$20,$03,$E0
	.db	$00,$00,$42,$3E,$FA,$AF,$BE,$00,$7D,$F7,$DF,$7C,$00,$00,$00,$40
	.db	$02,$00,$91,$65,$00,$42,$00,$20,$00,$20,$00,$20,$02,$20,$02,$00
	.db	$00,$00,$42,$22,$8A,$A8,$22,$00,$41,$04,$51,$40,$00,$00,$00,$40
	.db	$02,$01,$11,$55,$F0,$42,$00,$20,$03,$E0,$03,$E0,$03,$E0,$03,$E0
	.db	$00,$00,$42,$3E,$8A,$AF,$BE,$00,$7D,$04,$5F,$7C,$00,$00,$00,$40
	.db	$02,$02,$11,$4D,$00,$42,$00,$20,$02,$00,$00,$20,$00,$20,$00,$20
	.db	$00,$00,$42,$20,$8A,$A8,$24,$00,$05,$04,$52,$40,$00,$00,$00,$40
	.db	$02,$07,$DF,$45,$F0,$42,$00,$20,$03,$E0,$03,$E0,$00,$20,$03,$E0
	.db	$00,$00,$42,$20,$FB,$EF,$A2,$00,$7D,$F7,$D1,$7C,$00,$00,$00,$40
	.db	$02,$00,$00,$00,$00,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$20,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$40
	.db	$02,$7F,$F0,$7F,$F8,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$30,$42,$7F,$55,$55,$50,$00,$FE,$FE,$FE,$FE,$FE,$FE,$FE,$40
	.db	$02,$3F,$F0,$BF,$F4,$42,$01,$00,$01,$00,$01,$00,$01,$00,$01,$00
	.db	$0F,$F8,$42,$7F,$2A,$AA,$07,$00,$FE,$FE,$FE,$FE,$FE,$FE,$82,$40
	.db	$02,$1F,$EC,$DF,$EC,$42,$07,$C0,$05,$40,$05,$40,$05,$40,$05,$40
	.db	$0F,$FC,$42,$7F,$55,$50,$7F,$00,$FE,$FE,$FE,$FE,$FE,$FE,$BA,$40
	.db	$02,$00,$1C,$E0,$1C,$42,$0F,$E0,$0A,$A0,$0A,$A0,$0A,$A0,$0A,$A0
	.db	$0F,$FC,$42,$7F,$2A,$07,$7F,$00,$FE,$FE,$FE,$FE,$FE,$FE,$BA,$40
	.db	$02,$00,$1C,$E0,$1C,$42,$1F,$E0,$15,$40,$15,$40,$15,$40,$15,$40
	.db	$0F,$F8,$42,$7F,$50,$7F,$7F,$00,$FE,$FE,$FE,$FE,$FE,$FE,$BA,$40
	.db	$02,$00,$1C,$E0,$1C,$42,$3F,$E8,$2A,$A8,$2A,$A8,$2A,$A8,$2A,$A8
	.db	$00,$30,$42,$00,$07,$7F,$7F,$00,$FE,$FE,$FE,$FE,$FE,$FE,$82,$40
	.db	$02,$00,$1C,$E0,$1C,$42,$3F,$F8,$3F,$F8,$3F,$F8,$3F,$F8,$3F,$F8
	.db	$00,$20,$42,$7F,$7F,$7F,$7F,$00,$FE,$FE,$FE,$FE,$FE,$FE,$FE,$40
	.db	$02,$00,$1C,$E0,$1C,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$00,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$40
	.db	$02,$00,$0C,$C0,$0C,$42,$07,$C0,$07,$C0,$07,$C0,$07,$C0,$07,$C0
	.db	$00,$00,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$40
	.db	$02,$3F,$F4,$80,$04,$42,$3F,$E0,$3F,$E0,$3F,$E0,$3F,$E0,$3F,$E0
	.db	$00,$00,$42,$3E,$BE,$F8,$00,$00,$45,$7D,$10,$00,$00,$00,$00,$40
	.db	$02,$7F,$F8,$00,$00,$42,$00,$60,$00,$60,$00,$60,$00,$60,$00,$60
	.db	$00,$00,$42,$08,$AA,$80,$00,$00,$45,$41,$10,$00,$00,$00,$00,$40
	.db	$02,$3F,$F4,$80,$04,$42,$3F,$E0,$3F,$E0,$3F,$E0,$3F,$E0,$3F,$E0
	.db	$00,$00,$42,$08,$AA,$F8,$00,$00,$7D,$45,$F0,$00,$00,$00,$00,$40
	.db	$02,$00,$0C,$C0,$0C,$42,$00,$70,$00,$70,$00,$70,$00,$70,$00,$70
	.db	$01,$C0,$42,$08,$AA,$80,$00,$00,$45,$45,$10,$00,$00,$00,$00,$40
	.db	$02,$00,$1C,$E0,$1C,$42,$3F,$F0,$3F,$F0,$3F,$F0,$3F,$F0,$3F,$F0
	.db	$03,$E0,$42,$08,$AA,$F8,$00,$00,$45,$7D,$10,$00,$00,$00,$00,$40
	.db	$02,$00,$1C,$E0,$1C,$42,$00,$70,$00,$70,$00,$70,$00,$70,$00,$70
	.db	$07,$F0,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$40
	.db	$02,$00,$1C,$E0,$1C,$42,$3F,$F8,$3F,$F8,$3F,$F8,$3F,$F8,$3F,$F8
	.db	$0F,$F8,$42,$77,$77,$77,$77,$00,$FE,$FE,$FE,$FE,$FE,$FE,$FE,$40
	.db	$02,$00,$1C,$E0,$1C,$42,$00,$78,$00,$78,$00,$78,$00,$78,$00,$78
	.db	$1F,$FC,$42,$77,$77,$77,$77,$00,$FE,$FE,$FE,$FE,$FE,$FE,$82,$40
	.db	$02,$00,$1C,$E0,$1C,$42,$3F,$F8,$3F,$F8,$3F,$F8,$3F,$F8,$3F,$F8
	.db	$3F,$FE,$42,$77,$77,$77,$77,$00,$FE,$FE,$FE,$FE,$FE,$FE,$BA,$40
	.db	$02,$00,$1C,$E0,$1C,$42,$00,$7C,$00,$7C,$00,$7C,$00,$7C,$00,$7C
	.db	$00,$00,$42,$77,$77,$77,$77,$00,$FE,$FE,$FE,$FE,$FE,$FE,$BA,$40
	.db	$02,$1F,$EC,$DF,$EC,$42,$3F,$FC,$3F,$FC,$3F,$FC,$3F,$FC,$3F,$FC
	.db	$3F,$FE,$42,$77,$77,$77,$77,$00,$FE,$FE,$FE,$FE,$FE,$FE,$BA,$40
	.db	$02,$3F,$F4,$BF,$F4,$42,$00,$7C,$00,$7C,$00,$7C,$00,$7C,$00,$7C
	.db	$3F,$FE,$42,$77,$77,$77,$77,$00,$FE,$FE,$FE,$FE,$FE,$FE,$82,$40
	.db	$02,$7F,$F8,$7F,$F8,$42,$3F,$FE,$3F,$FE,$3F,$FE,$3F,$FE,$3F,$FE
	.db	$3F,$FE,$42,$77,$77,$77,$77,$00,$FE,$FE,$FE,$FE,$FE,$FE,$FE,$40
	.db	$02,$00,$00,$00,$00,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$00,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$40
	.db	$02,$00,$00,$00,$00,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$00,$42,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$40
	.db	$03,$FF,$FF,$FF,$FF,$C3,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF
	.db	$FF,$FF,$C3,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$FF,$C0

Spacecraft:	;binclude "../data/spacecraft.bin"
	.db	$00,$FF,$FF,$FF,$FF,$FF,$FF,$FF
	.db	$FF,$FF,$FF,$FF,$2B,$FF,$C0,$98
	.db	$61,$BF,$FB,$FF,$FF,$F9,$55,$55
	.db	$37,$FF,$81,$86,$18,$7F,$F7,$FF
	.db	$FF,$E2,$AA,$AB,$2F,$FF,$02,$61
	.db	$86,$FF,$EF,$FF,$FF,$95,$55,$55
	.db	$1F,$FE,$06,$18,$61,$FF,$DF,$FF
	.db	$FE,$2A,$AA,$AB,$3F,$FC,$09,$86
	.db	$1B,$FF,$BF,$FF,$F9,$55,$55,$55
	.db	$5F,$F8,$18,$61,$87,$FF,$7F,$FF
	.db	$E2,$AA,$AA,$AB,$57,$F0,$26,$18
	.db	$6F,$FE,$FF,$FF,$95,$55,$55,$55
	.db	$02,$55,$E0,$61,$86,$1F,$FD,$FF
	.db	$FE,$2A,$AA,$AA,$AB,$08,$55,$C0
	.db	$98,$61,$BF,$FB,$FF,$F9,$55,$55
	.db	$55,$55,$20,$55,$41,$86,$18,$7F
	.db	$F7,$FF,$E2,$AA,$AA,$AA,$AB,$80
	.db	$55,$42,$61,$86,$FF,$EF,$FF,$95
	.db	$55,$55,$55,$55,$40,$55,$46,$18
	.db	$61,$FF,$DF,$FE,$2A,$AA,$AA,$AA
	.db	$AB,$10,$55,$49,$86,$1B,$FF,$BF
	.db	$F9,$55,$55,$55,$55,$55,$04,$55
	.db	$58,$61,$87,$FF,$7F,$E2,$AA,$AA
	.db	$AA,$AA,$AB,$00,$55,$66,$18,$6F
	.db	$FE,$FF,$95,$55,$55,$55,$55,$55
	.db	$02,$40,$02,$40,$04,$55,$61,$86
	.db	$1F,$FD,$FE,$2A,$AA,$AA,$AA,$AA
	.db	$AB,$08,$10,$08,$10,$10,$55,$98
	.db	$61,$BF,$FB,$F9,$55,$55,$55,$55
	.db	$55,$55,$20,$01,$00,$04,$40,$55
	.db	$86,$18,$7F,$F7,$E2,$AA,$AA,$AA
	.db	$AA,$AA,$AB,$80,$07,$C0,$00,$00
	.db	$56,$61,$86,$BF,$EF,$95,$55,$55
	.db	$55,$55,$55,$55,$40,$1F,$F0,$00
	.db	$00,$56,$18,$61,$AF,$DE,$2A,$AA
	.db	$AA,$AA,$AA,$AA,$AB,$10,$7F,$E8
	.db	$01,$80,$59,$86,$18,$AB,$B9,$55
	.db	$55,$55,$55,$55,$55,$55,$01,$FF
	.db	$B4,$04,$60,$58,$01,$86,$AA,$62
	.db	$AA,$AA,$AA,$AA,$AA,$AA,$AB,$07
	.db	$FE,$DA,$0B,$18,$64,$38,$61,$AA
	.db	$18,$00,$1C,$00,$0E,$00,$00,$1F
	.db	$40,$1F,$FB,$6A,$75,$C6,$E0,$E6
	.db	$19,$AA,$FB,$FF,$DD,$FF,$EE,$FF
	.db	$FF,$DF,$10,$7F,$ED,$AA,$AA,$B1
	.db	$83,$E1,$87,$AA,$FB,$FF,$DD,$FF
	.db	$EE,$FF,$FF,$DF,$01,$FF,$B6,$AA
	.db	$55,$5C,$0F,$98,$67,$AA,$FB,$FF
	.db	$DD,$FF,$EE,$FF,$FF,$DF,$03,$DC
	.db	$DA,$AA,$EA,$A0,$3F,$86,$1F,$AA
	.db	$FB,$00,$DD,$80,$6E,$E3,$80,$DF
	.db	$03,$EE,$6A,$AA,$F5,$40,$FE,$61
	.db	$9F,$AA,$FB,$FF,$DD,$FF,$EE,$DC
	.db	$70,$DF,$04,$F7,$2A,$AA,$AE,$03
	.db	$FD,$98,$7F,$AA,$FB,$00,$DD,$80
	.db	$6E,$E3,$80,$DF,$07,$77,$AA,$AB
	.db	$D4,$0F,$FC,$66,$7F,$AA,$FB,$FF
	.db	$DD,$FF,$EE,$DC,$70,$DF,$0F,$F7
	.db	$AA,$AF,$E0,$3F,$FF,$19,$FF,$AA
	.db	$FB,$00,$DD,$80,$6E,$E3,$80,$DF
	.db	$02,$40,$00,$3F,$F7,$A6,$BF,$F0
	.db	$FF,$FD,$C7,$FF,$AA,$FB,$FF,$DD
	.db	$FF,$EE,$DC,$70,$DF,$08,$10,$00
	.db	$FF,$F7,$9E,$FF,$E3,$FF,$FA,$B1
	.db	$FF,$AA,$FB,$00,$DD,$80,$6E,$E3
	.db	$80,$DF,$20,$04,$03,$E1,$E7,$5F
	.db	$FF,$FF,$FD,$D5,$5C,$7F,$AA,$FB
	.db	$FF,$DD,$FF,$EE,$DC,$70,$DF,$80
	.db	$00,$0F,$80,$02,$9F,$FF,$7F,$FA
	.db	$EA,$AB,$1F,$AA,$FB,$00,$DD,$80
	.db	$6E,$E3,$88,$DF,$40,$00,$3E,$05
	.db	$00,$5F,$FB,$FF,$D5,$75,$55,$C7
	.db	$AA,$FB,$FF,$DD,$FF,$EE,$DC,$7C
	.db	$DF,$10,$00,$F8,$1A,$A0,$0F,$DF
	.db	$FF,$AA,$AE,$AA,$B1,$AA,$FB,$00
	.db	$DD,$80,$6E,$E3,$FE,$DF,$04,$03
	.db	$E0,$55,$50,$3A,$FF,$FF,$55,$57
	.db	$55,$5D,$AA,$FB,$FF,$DD,$FF,$EE
	.db	$C0,$00,$DF,$00,$0F,$80,$AA,$AA
	.db	$7F,$FF,$FC,$EA,$AA,$EA,$BD,$AA
	.db	$FB,$FF,$DD,$FF,$EE,$FF,$FF,$DF
	.db	$01,$BE,$01,$55,$55,$7F,$FF,$D7
	.db	$35,$57,$D5,$F5,$AA,$FB,$FF,$DD
	.db	$FF,$EE,$FF,$FF,$DF,$03,$F8,$02
	.db	$AA,$AA,$FF,$FF,$AA,$CE,$AF,$EB
	.db	$C5,$EA,$FB,$FF,$DD,$FF,$EE,$FF
	.db	$FF,$DF,$23,$60,$05,$55,$55,$FF
	.db	$FD,$55,$73,$7F,$DF,$15,$FA,$FA
	.db	$AA,$DD,$55,$6E,$AA,$AA,$DF,$86
	.db	$40,$0A,$AA,$AB,$FF,$F2,$AA,$AC
	.db	$FF,$BC,$05,$CE,$FB,$55,$5D,$AA
	.db	$AE,$D5,$55,$5F,$19,$80,$15,$55
	.db	$57,$FF,$F0,$55,$53,$7D,$F1,$55
	.db	$83,$FA,$AA,$DD,$55,$6E,$AA,$AA
	.db	$DF,$00,$00,$2A,$AA,$AB,$FF,$F0
	.db	$0A,$AF,$7B,$C0,$05,$00,$03,$55
	.db	$41,$AA,$A0,$D5,$55,$5F,$00,$00
	.db	$55,$55,$57,$FF,$D4,$05,$7F,$5F
	.db	$15,$54,$00,$02,$AA,$C5,$55,$6C
	.db	$AA,$AA,$C1,$01,$00,$AA,$AA,$AA
	.db	$AA,$AA,$02,$FF,$BC,$00,$0C,$00
	.db	$03,$FF,$C5,$FF,$E8,$FF,$FF,$C1
	.db	$02,$41,$55,$55,$55,$55,$55,$41
	.db	$FD,$F1,$55,$32,$00,$00,$00,$0C
	.db	$00,$08,$00,$00,$01,$08,$02,$AA
	.db	$AA,$AA,$AA,$AA,$A1,$FB,$C0,$00
	.db	$CF,$00,$00,$00,$0F,$FD,$F0,$00
	.db	$00,$01,$20,$05,$54,$45,$55,$55
	.db	$55,$55,$DF,$D5,$53,$3F,$80,$00
	.db	$00,$1F,$FB,$F6,$00,$00,$01,$80
	.db	$0A,$A9,$B2,$AA,$AA,$AA,$AB,$BF
	.db	$C0,$0C,$FF,$C0,$00,$00,$1F,$FB
	.db	$E5,$80,$00,$01,$40,$15,$47,$5C
	.db	$55,$55,$55,$55,$FF,$D5,$33,$FF
	.db	$C0,$00,$00,$3F,$F7,$EA,$E0,$00
	.db	$01,$10,$2A,$9A,$AB,$2A,$AA,$AA
	.db	$AB,$FF,$C0,$CF,$FF,$E0,$00,$00
	.db	$3F,$F7,$D5,$58,$00,$01,$04,$54
	.db	$75,$55,$D5,$55,$55,$5F,$FF,$D3
	.db	$3F,$FF,$E0,$00,$00,$7F,$EF,$CA
	.db	$A6,$00,$01,$00,$A9,$AA,$AB,$AA
	.db	$AA,$AA,$BF,$FF,$CC,$FF,$FF,$F0
	.db	$00,$00,$7F,$EF,$D5,$41,$00,$01
	.db	$01,$47,$55,$57,$55,$55,$55,$FF
	.db	$FC,$FF,$FF,$FF,$F0,$00,$01,$FF
	.db	$DE,$CA,$06,$80,$01,$02,$9E,$AA
	.db	$BE,$AA,$AA,$AB,$FF,$F0,$FD,$FF
	.db	$FF,$F8,$00,$06,$FF,$DB,$A4,$19
	.db	$80,$01,$25,$23,$55,$7D,$55,$55
	.db	$5F,$FF,$C0,$FD,$FF,$FF,$F8,$00
	.db	$1B,$3F,$BE,$70,$67,$80,$01,$8A
	.db	$C0,$EB,$FA,$AA,$AA,$BE,$FF,$C3
	.db	$FD,$7F,$FF,$FC,$00,$67,$CF,$B9
	.db	$C1,$9F,$80,$01,$15,$5E,$37,$F5
	.db	$55,$55,$FE,$FD,$CF,$FD,$7F,$FF
	.db	$FC,$00,$81,$F3,$67,$06,$7F,$80
	.db	$01,$2A,$FF,$1F,$EA,$AA,$AB,$FE
	.db	$F1,$FC,$FD,$7F,$FF,$FC,$00,$C0
	.db	$7C,$1C,$19,$FF,$00,$01,$55,$7F
	.db	$9F,$D5,$55,$5F,$FE,$F1,$B8,$FD
	.db	$5F,$FF,$F8,$01,$30,$1F,$70,$67
	.db	$FC,$00,$01,$FA,$E7,$CF,$AA,$AA
	.db	$BF,$FE,$F1,$98,$FD,$5F,$FF,$E0
	.db	$01,$CC,$07,$C1,$9F,$F0,$00,$01
	.db	$BD,$63,$CF,$55,$55,$FF,$FE,$F1
	.db	$88,$FD,$5F,$FF,$80,$01,$33,$01
	.db	$06,$7F,$C0,$8F,$F7,$CE,$AA,$AB
	.db	$FF,$FE,$F1,$C0,$FD,$57,$FE,$00
	.db	$01,$0C,$C0,$19,$FF,$00,$83,$DF
	.db	$CD,$55,$5F,$FF,$FE,$F1,$E0,$FD
	.db	$57,$F8,$00,$00,$C3,$30,$67,$FC
	.db	$00,$C0,$F7,$EA,$AA,$BF,$FF,$FE
	.db	$F1,$33,$FD,$55,$E0,$00,$00,$30
	.db	$CD,$9F,$F0,$00,$30,$3D,$15,$55
	.db	$FF,$FF,$FE,$F0,$1F,$FF,$FF,$80
	.db	$00,$02,$0C,$32,$7F,$C0,$40,$0C
	.db	$0F,$0A,$AB,$FF,$FF,$FE,$F0,$3F
	.db	$F0,$00,$00,$00,$08,$03,$0D,$FF
	.db	$00,$10,$03,$03,$D5,$5F,$FF,$FF
	.db	$FE,$F0,$FF,$C0,$00,$00,$04,$20
	.db	$00,$C3,$FC,$00,$04,$00,$C0,$FA
	.db	$BF,$FF,$FF,$FE,$F3,$FF,$00,$00
	.db	$00,$01,$80,$00,$33,$F0,$00,$01
	.db	$02,$30,$3D,$FF,$FF,$FF,$FE,$FF
	.db	$FC,$00,$00,$00,$02,$40,$02,$0F
	.db	$C0,$08,$0C,$0F,$FF,$FF,$FF,$FE
	.db	$FF,$F0,$00,$00,$00,$08,$10,$08
	.db	$03,$00,$20,$03,$03,$FF,$FF,$FF
	.db	$FE,$FF,$C0,$00,$00,$04,$20,$04
	.db	$20,$00,$00,$80,$00,$C1,$FF,$FF
	.db	$FF,$FE,$FF,$00,$00,$00,$01,$80
	.db	$01,$80,$00,$00,$40,$00,$31,$FF
	.db	$FF,$FF,$FE,$FC,$00,$00,$40,$02
	.db	$40,$02,$40,$02,$40,$00,$00,$0D
	.db	$FF,$FF,$FF,$FE,$F0,$00,$00,$10
	.db	$08,$10,$08,$10,$08,$10,$00,$00
	.db	$03,$FF,$FF,$FF,$FE,$C0,$00,$00
	.db	$04,$20,$04,$20,$04,$20,$04,$00
	.db	$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$01,$80,$01,$80,$01,$80,$01
	.db	$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$00,$00,$00,$00,$00,$00,$00
	.db	$00,$00,$00,$00,$00,$00,$00,$00
	.db	$02,$00,$00,$00,$00,$00,$00,$40
	.db	$08,$00,$00,$00,$00,$00,$00,$10
	.db	$20,$00,$00,$00,$00,$00,$00,$04
	.db	$80,$00,$00,$00,$00,$00,$00,$01

; Надпись LASERTRON ACTIVATED
LtronAct:	;binclude "../data/ltron-activated.bin"
;TODO

;------------------------------------------------------------------------------
; 57 maskovanych spritov - 24x24 bodov (4 zn. stlpce)
; 4x24x2 = 192 bytov na sprite
; 57x192 = 10944 bytov celkom
; organizacia spritu - 4 byty masky, 4 byty predlohy atd.
Sprites:	;binclude "../data/sprites.bin"
SprBrickM:	
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$46,$00 ; 0
	.db	$FC,$00,$3F,$01,$19,$80, $F0,$00,$0F,$04,$46,$60
	.db	$F0,$00,$1F,$01,$19,$80, $F0,$00,$0F,$04,$46,$60
	.db	$F0,$00,$1F,$01,$19,$80, $F0,$00,$0F,$04,$26,$60
	.db	$F0,$00,$1F,$00,$99,$80, $F0,$00,$3F,$02,$26,$40
	.db	$F8,$00,$1F,$00,$99,$80, $F8,$00,$3F,$02,$26,$40
	.db	$F8,$00,$1F,$00,$99,$80, $F8,$00,$3F,$02,$46,$40
	.db	$FC,$00,$1F,$01,$19,$80, $FC,$00,$7F,$00,$46,$00
	.db	$FC,$00,$3F,$01,$19,$80, $FC,$00,$7F,$00,$7E,$00
	.db	$FE,$00,$7F,$01,$FF,$80, $FF,$81,$FF,$00,$7E,$00
	.db	$FF,$E7,$FF,$00,$18,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBrickA3:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$46,$00 ; 1
	.db	$FC,$00,$3F,$01,$19,$80, $F0,$00,$0F,$04,$C2,$60
	.db	$F0,$00,$0F,$01,$39,$80, $FC,$00,$3F,$00,$A6,$00
	.db	$FE,$00,$7F,$00,$B9,$00, $FE,$00,$7F,$00,$44,$00
	.db	$FF,$01,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$10,$00
	.db	$FF,$83,$FF,$00,$18,$00, $FF,$83,$FF,$00,$30,$00
	.db	$FF,$01,$FF,$00,$18,$00, $FF,$01,$FF,$00,$54,$00
	.db	$FF,$00,$FF,$00,$28,$00, $FF,$00,$FF,$00,$46,$00
	.db	$FF,$00,$FF,$00,$18,$00, $FF,$00,$FF,$00,$7E,$00
	.db	$FF,$81,$FF,$00,$18,$00, $FF,$E7,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBrickA2:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$46,$00 ; 2
	.db	$FC,$00,$3F,$01,$19,$80, $F0,$00,$0F,$04,$46,$60
	.db	$F0,$00,$0F,$01,$19,$80, $F0,$00,$0F,$04,$56,$60
	.db	$F0,$00,$0F,$01,$39,$80, $F8,$00,$1F,$02,$4E,$40
	.db	$F8,$00,$1F,$00,$B9,$80, $FE,$00,$3F,$00,$56,$00
	.db	$FF,$00,$7F,$00,$31,$00, $FF,$00,$7F,$00,$5C,$00
	.db	$FE,$00,$7F,$00,$22,$00, $FE,$00,$7F,$00,$99,$00
	.db	$FC,$00,$3F,$00,$46,$00, $FC,$00,$3F,$01,$19,$80
	.db	$FC,$00,$3F,$00,$7E,$00, $FC,$00,$3F,$01,$E7,$80
	.db	$FE,$00,$7F,$00,$7E,$00, $FF,$81,$FF,$00,$18,$00
	.db	$FF,$E7,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprDisc1
	.db	$FF,$FF,$FF,$00,$55,$00, $FF,$FF,$FF,$02,$AA,$80 ; 3
	.db	$FF,$FF,$FF,$05,$55,$40, $FF,$FF,$FF,$02,$AA,$A0
	.db	$FF,$FF,$FF,$05,$55,$40, $FF,$FF,$FF,$02,$AA,$A0
	.db	$FF,$FF,$FF,$01,$55,$40, $FF,$FF,$FF,$00,$AA,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FE,$00,$7F,$00,$00,$00
	.db	$F8,$00,$1F,$00,$FF,$00, $F0,$00,$0F,$03,$4C,$C0
	.db	$F0,$00,$0F,$06,$FF,$A0, $F0,$00,$0F,$03,$FF,$E0
	.db	$F0,$00,$0F,$07,$FF,$E0, $F0,$00,$0F,$07,$FF,$E0
	.db	$F0,$00,$0F,$07,$FF,$E0, $F0,$00,$0F,$03,$7F,$C0
	.db	$F8,$00,$1F,$00,$BF,$00, $FE,$00,$7F,$00,$3C,$00
	.db	$FF,$81,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprDisc2:
	.db	$FF,$FF,$FF,$00,$55,$00, $FF,$FF,$FF,$02,$AA,$80 ; 4
	.db	$FF,$FF,$FF,$05,$55,$40, $FF,$FF,$FF,$02,$AA,$A0
	.db	$FF,$FF,$FF,$05,$55,$40, $FF,$FF,$FF,$02,$AA,$A0
	.db	$FF,$FF,$FF,$01,$55,$40, $FF,$FF,$FF,$00,$AA,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FE,$00,$7F,$00,$00,$00
	.db	$F8,$00,$1F,$00,$FF,$00, $F0,$00,$0F,$03,$32,$C0
	.db	$F0,$00,$0F,$05,$FF,$60, $F0,$00,$0F,$07,$FF,$C0
	.db	$F0,$00,$0F,$07,$FF,$E0, $F0,$00,$0F,$07,$FF,$E0
	.db	$F0,$00,$0F,$07,$FF,$E0, $F0,$00,$0F,$03,$7F,$C0
	.db	$F8,$00,$1F,$00,$BF,$00, $FE,$00,$7F,$00,$3C,$00
	.db	$FF,$81,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprRough:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$66,$00 ; 5
	.db	$FC,$00,$3F,$01,$99,$80, $F0,$00,$0F,$06,$66,$60
	.db	$FC,$00,$3F,$01,$99,$80, $FF,$00,$FF,$00,$66,$00
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBrickA1:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$46,$00 ; 6
	.db	$FC,$00,$3F,$01,$19,$80, $F0,$00,$0F,$04,$46,$60
	.db	$F0,$00,$0F,$01,$19,$80, $F0,$00,$0F,$04,$46,$60
	.db	$F0,$00,$0F,$01,$19,$80, $F0,$00,$0F,$04,$46,$60
	.db	$F0,$00,$0F,$01,$19,$80, $F0,$00,$0F,$04,$46,$60
	.db	$F0,$00,$0F,$01,$19,$80, $F0,$00,$0F,$04,$46,$60
	.db	$F0,$00,$0F,$01,$19,$80, $F0,$00,$0F,$04,$46,$60
	.db	$F0,$00,$0F,$01,$19,$80, $F0,$00,$0F,$04,$7E,$60
	.db	$F0,$00,$0F,$01,$E7,$80, $F0,$00,$0F,$07,$81,$E0
	.db	$F8,$00,$1F,$01,$E7,$80, $FE,$00,$7F,$00,$7E,$00
	.db	$FF,$81,$FF,$00,$18,$00, $FF,$E7,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBlast1:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00 ; 7
	.db	$FF,$E3,$FF,$00,$00,$00, $FF,$C1,$FF,$00,$08,$00
	.db	$FF,$80,$FF,$00,$14,$00, $FF,$00,$7F,$00,$2A,$00
	.db	$FF,$00,$3F,$00,$DD,$00, $FF,$00,$3F,$00,$FE,$80
	.db	$FF,$00,$3F,$01,$D5,$00, $FF,$00,$7F,$01,$3E,$00
	.db	$FE,$00,$3F,$00,$75,$00, $FC,$00,$1F,$00,$AE,$80
	.db	$FC,$00,$1F,$01,$5F,$40, $FC,$00,$1F,$00,$BE,$80
	.db	$FE,$00,$3F,$00,$7F,$00, $FC,$00,$1F,$00,$BE,$80
	.db	$FC,$00,$1F,$01,$7D,$40, $FC,$00,$1F,$00,$AF,$80
	.db	$F8,$00,$1F,$01,$7D,$C0, $F8,$00,$1F,$02,$BE,$80
	.db	$F8,$00,$1F,$01,$7D,$40, $FC,$00,$1F,$00,$AE,$80
	.db	$FE,$00,$3F,$00,$FD,$00, $FE,$00,$7F,$00,$00,$00
SprBlast2:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$C1,$FF,$00,$00,$00 ; 8
	.db	$FF,$80,$FF,$00,$14,$00, $FF,$00,$7F,$00,$2A,$00
	.db	$FF,$00,$7F,$00,$55,$00, $F0,$00,$7F,$00,$2A,$00
	.db	$F0,$00,$3F,$05,$55,$00, $F0,$00,$3F,$02,$BA,$80
	.db	$F8,$00,$3F,$03,$7D,$00, $F8,$00,$1F,$01,$AE,$00
	.db	$FC,$00,$1F,$00,$FD,$40, $FE,$00,$1F,$00,$FE,$C0
	.db	$FE,$00,$1F,$00,$75,$80, $F8,$00,$3F,$00,$BF,$80
	.db	$F0,$00,$3F,$03,$FF,$00, $F0,$00,$3F,$06,$BE,$80
	.db	$F0,$00,$0F,$00,$7F,$00, $F0,$00,$0F,$00,$2F,$E0
	.db	$F0,$00,$0F,$07,$FF,$00, $F0,$00,$1F,$00,$AF,$80
	.db	$FE,$00,$1F,$00,$7D,$C0, $FE,$00,$1F,$00,$BA,$40
	.db	$FE,$00,$1F,$00,$74,$00, $FF,$01,$FF,$00,$00,$00
SprBlast3:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$83,$FF,$00,$00,$00 ; 9
	.db	$FF,$00,$7F,$00,$28,$00, $FE,$00,$3F,$00,$55,$00
	.db	$FC,$00,$3F,$00,$BA,$80, $F8,$00,$3F,$01,$7D,$00
	.db	$F8,$00,$1F,$02,$BA,$80, $F8,$00,$1F,$01,$5D,$40
	.db	$F8,$00,$1F,$02,$EA,$80, $F8,$00,$3F,$01,$75,$00
	.db	$FC,$00,$0F,$00,$EE,$80, $FC,$00,$0F,$01,$7D,$60
	.db	$F0,$00,$0F,$00,$BA,$C0, $F0,$00,$1F,$06,$5D,$00
	.db	$F0,$00,$0F,$01,$FE,$00, $FC,$00,$0F,$00,$DD,$20
	.db	$F8,$00,$0F,$00,$BA,$40, $F8,$00,$1F,$02,$7C,$C0
	.db	$F8,$00,$1F,$03,$3F,$80, $F0,$00,$1F,$01,$D5,$00
	.db	$F0,$00,$1F,$04,$AE,$40, $F0,$00,$1F,$00,$50,$80
	.db	$FF,$06,$1F,$00,$20,$40, $FF,$8F,$1F,$00,$00,$00
SprBlast4:
	.db	$FF,$80,$FF,$00,$00,$00, $FC,$00,$1F,$00,$2A,$00 ; 10
	.db	$F8,$00,$0F,$01,$55,$40, $F0,$00,$0F,$02,$BA,$A0
	.db	$F0,$00,$0F,$05,$5F,$40, $F0,$00,$0F,$02,$FE,$A0
	.db	$F0,$00,$0F,$05,$7D,$40, $F0,$00,$1F,$02,$FA,$80
	.db	$F8,$00,$3F,$03,$7D,$00, $F0,$00,$0F,$01,$FE,$80
	.db	$F0,$00,$0F,$07,$F5,$20, $F0,$00,$0F,$00,$FA,$40
	.db	$FC,$00,$1F,$01,$7D,$40, $FC,$00,$1F,$00,$AA,$80
	.db	$F8,$00,$3F,$00,$77,$00, $F8,$00,$7F,$02,$AE,$00
	.db	$F0,$00,$FF,$02,$7C,$00, $F0,$00,$1F,$04,$2A,$00
	.db	$F1,$00,$1F,$00,$50,$40, $FF,$03,$1F,$00,$28,$00
	.db	$FF,$83,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBlast5:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$01,$FF,$00,$00,$00 ; 11
	.db	$FE,$00,$FF,$00,$54,$00, $FC,$00,$7F,$00,$BA,$00
	.db	$F8,$00,$3F,$01,$55,$00, $F8,$00,$3F,$02,$AE,$80
	.db	$F8,$00,$3F,$01,$55,$00, $F8,$00,$3F,$03,$FA,$80
	.db	$F8,$00,$3F,$01,$DD,$00, $F8,$00,$7F,$02,$E8,$00
	.db	$F8,$00,$7F,$01,$FD,$00, $FC,$00,$7F,$00,$78,$00
	.db	$FF,$03,$FF,$00,$58,$00, $FE,$01,$FF,$00,$68,$00
	.db	$FE,$01,$FF,$00,$94,$00, $FE,$01,$FF,$00,$28,$00
	.db	$FF,$81,$FF,$00,$14,$00, $FF,$81,$FF,$00,$28,$00
	.db	$FF,$83,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBlast6:
	.db	$FF,$83,$FF,$00,$00,$00, $FF,$01,$FF,$00,$28,$00 ; 12
	.db	$FF,$00,$FF,$00,$54,$00, $FF,$00,$FF,$00,$2A,$00
	.db	$FF,$00,$FF,$00,$54,$00, $FF,$01,$FF,$00,$08,$00
	.db	$FF,$C3,$FF,$00,$10,$00, $FF,$01,$FF,$00,$08,$00
	.db	$FF,$01,$FF,$00,$54,$00, $FF,$01,$FF,$00,$20,$00
	.db	$FF,$83,$FF,$00,$10,$00, $FF,$83,$FF,$00,$28,$00
	.db	$FF,$83,$FF,$00,$10,$00, $FF,$C3,$FF,$00,$08,$00
	.db	$FF,$E3,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprAutoVorton:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$00,$FF,$00,$7E,$00 ; 13
	.db	$FE,$00,$7F,$00,$81,$00, $F8,$00,$3F,$02,$7E,$80
	.db	$F0,$00,$1F,$04,$81,$C0, $F0,$00,$1F,$02,$7E,$C0
	.db	$F0,$00,$1F,$04,$81,$C0, $F0,$00,$1F,$02,$7E,$80
	.db	$F0,$00,$3F,$04,$81,$80, $F0,$00,$3F,$02,$7E,$80
	.db	$F0,$00,$3F,$04,$81,$00, $F0,$00,$7F,$02,$7E,$00
	.db	$F0,$00,$7F,$04,$FF,$00, $F0,$00,$7F,$03,$C3,$00
	.db	$F0,$00,$7F,$07,$00,$00, $F0,$00,$3F,$06,$56,$00
	.db	$F0,$00,$1F,$00,$AB,$80, $F8,$00,$1F,$01,$55,$C0
	.db	$F8,$00,$1F,$02,$AB,$C0, $F8,$00,$1F,$01,$57,$80
	.db	$FC,$00,$3F,$00,$AB,$00, $FE,$00,$7F,$00,$56,$00
	.db	$FF,$00,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$00,$00
SprGlassBrick:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$76,$00 ; 14
	.db	$FC,$00,$3F,$01,$B1,$80, $F0,$00,$0F,$06,$54,$60
	.db	$F0,$00,$0F,$05,$31,$20, $F0,$00,$0F,$04,$54,$20
	.db	$F0,$01,$8F,$04,$B0,$20, $F1,$07,$8F,$04,$50,$20
	.db	$F0,$07,$8F,$04,$90,$20, $F0,$07,$8F,$05,$10,$20
	.db	$F0,$07,$8F,$06,$90,$20, $F0,$47,$8F,$05,$10,$20
	.db	$F0,$C7,$8F,$06,$10,$20, $F1,$C7,$8F,$04,$10,$20
	.db	$F0,$C7,$8F,$06,$10,$20, $F1,$81,$8F,$04,$18,$20
	.db	$F0,$00,$0F,$04,$66,$20, $F0,$08,$0F,$05,$81,$A0
	.db	$F0,$46,$0F,$06,$10,$60, $F8,$00,$1F,$01,$91,$80
	.db	$FE,$00,$7F,$00,$76,$00, $FF,$81,$FF,$00,$18,$00
	.db	$FF,$E7,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBarrel:
	.db	$FF,$FF,$FF,$00,$00,$00, $FE,$00,$7F,$00,$FF,$00 ; 15
	.db	$F8,$00,$1F,$03,$00,$C0, $F0,$00,$0F,$04,$FF,$20
	.db	$F0,$00,$0F,$03,$FF,$C0, $F0,$00,$0F,$05,$FF,$E0
	.db	$F0,$00,$0F,$02,$FF,$E0, $F0,$00,$0F,$05,$FF,$E0
	.db	$F0,$00,$0F,$02,$00,$E0, $F0,$00,$0F,$04,$FF,$20
	.db	$F0,$00,$0F,$03,$FF,$C0, $F0,$00,$0F,$05,$FF,$E0
	.db	$F0,$00,$0F,$02,$FF,$E0, $F0,$00,$0F,$05,$FF,$E0
	.db	$F0,$00,$0F,$02,$00,$E0, $F0,$00,$0F,$04,$FF,$20
	.db	$F0,$00,$0F,$03,$FF,$C0, $F0,$00,$0F,$07,$FF,$E0
	.db	$F0,$00,$0F,$07,$FF,$E0, $F0,$00,$0F,$07,$FF,$E0
	.db	$F8,$00,$1F,$03,$FF,$C0, $FC,$00,$3F,$00,$FF,$00
	.db	$FF,$00,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBlock:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$2E,$00 ; 16
	.db	$FC,$00,$3F,$01,$5F,$80, $F0,$00,$0F,$02,$AF,$E0
	.db	$F0,$00,$0F,$05,$47,$E0, $F0,$00,$0F,$02,$89,$E0
	.db	$F0,$00,$0F,$04,$5E,$60, $F0,$00,$0F,$00,$AF,$80
	.db	$F0,$00,$0F,$05,$5F,$E0, $F0,$00,$0F,$02,$A7,$E0
	.db	$F0,$00,$0F,$05,$19,$E0, $F0,$00,$0F,$02,$2E,$60
	.db	$F0,$00,$0F,$01,$5F,$80, $F0,$00,$0F,$02,$AF,$E0
	.db	$F0,$00,$0F,$05,$47,$E0, $F0,$00,$0F,$02,$99,$E0
	.db	$F0,$00,$0F,$04,$7E,$60, $F0,$00,$0F,$01,$FF,$80
	.db	$F0,$00,$0F,$07,$FF,$E0, $F8,$00,$1F,$01,$FF,$80
	.db	$FE,$00,$7F,$00,$7E,$00, $FF,$81,$FF,$00,$18,$00
	.db	$FF,$E7,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprFlame1:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$66,$00 ; 17
	.db	$FC,$00,$3F,$01,$99,$80, $F0,$00,$0F,$06,$7E,$60
	.db	$F0,$00,$0F,$07,$FF,$E0, $F8,$00,$1F,$01,$DF,$80
	.db	$FE,$00,$7F,$00,$7A,$00, $FF,$00,$FF,$00,$5C,$00
	.db	$FF,$00,$7F,$00,$3A,$00, $FF,$00,$7F,$00,$55,$00
	.db	$FF,$00,$7F,$00,$2A,$00, $FE,$00,$3F,$00,$55,$00
	.db	$FC,$00,$3F,$00,$AA,$80, $FC,$00,$3F,$01,$55,$00
	.db	$FC,$00,$7F,$00,$AA,$00, $FE,$00,$FF,$00,$54,$00
	.db	$FF,$00,$FF,$00,$2A,$00, $FF,$80,$FF,$00,$10,$00
	.db	$FF,$01,$FF,$00,$00,$00, $FF,$03,$FF,$00,$40,$00
	.db	$FF,$03,$FF,$00,$28,$00, $FF,$83,$FF,$00,$10,$00
	.db	$FF,$C7,$FF,$00,$00,$00, $FF,$EF,$FF,$00,$00,$00
SprFlame2:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$66,$00 ; 18
	.db	$FC,$00,$3F,$01,$99,$80, $F0,$00,$0F,$06,$7E,$60
	.db	$F0,$00,$0F,$07,$FF,$E0, $F8,$00,$1F,$01,$FF,$80
	.db	$FE,$00,$7F,$00,$7E,$00, $FE,$01,$FF,$00,$F8,$00
	.db	$FE,$01,$FF,$00,$74,$00, $FE,$01,$FF,$00,$F8,$00
	.db	$FE,$00,$FF,$00,$74,$00, $FC,$00,$7F,$00,$EA,$00
	.db	$F8,$00,$7F,$01,$55,$00, $F0,$00,$7F,$02,$AA,$00
	.db	$F0,$00,$7F,$05,$41,$00, $F0,$00,$3F,$02,$A2,$00
	.db	$F8,$08,$1F,$01,$41,$40, $FC,$18,$1F,$00,$80,$00
	.db	$FC,$1C,$1F,$01,$00,$40, $FC,$7C,$1F,$01,$00,$80
	.db	$FC,$7E,$3F,$00,$00,$80, $FC,$FE,$3F,$00,$00,$00
	.db	$FE,$FF,$7F,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprFlame3:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$66,$00 ; 19
	.db	$FC,$00,$3F,$01,$99,$80, $F0,$00,$0F,$06,$7E,$60
	.db	$F0,$00,$0F,$07,$FF,$E0, $F8,$00,$1F,$01,$FB,$80
	.db	$FE,$00,$7F,$00,$7E,$00, $FE,$00,$FF,$00,$5E,$00
	.db	$FE,$00,$7F,$00,$BE,$00, $FE,$00,$7F,$00,$7D,$00
	.db	$FE,$00,$7F,$00,$BA,$00, $FE,$00,$3F,$00,$5D,$00
	.db	$FC,$00,$3F,$00,$AA,$80, $FC,$00,$3F,$01,$5D,$00
	.db	$FC,$00,$7F,$00,$AA,$00, $FE,$00,$7F,$00,$55,$00
	.db	$FE,$00,$7F,$00,$A8,$00, $FE,$03,$FF,$00,$10,$00
	.db	$F9,$C6,$3F,$00,$00,$00, $F1,$FE,$1F,$00,$00,$00
	.db	$F1,$FE,$1F,$04,$00,$40, $F1,$FE,$1F,$00,$00,$C0
	.db	$FB,$FE,$1F,$00,$00,$00, $FF,$FF,$3F,$00,$00,$00
SprFlame4:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$66,$00 ; 20
	.db	$FC,$00,$3F,$01,$99,$80, $F0,$00,$0F,$06,$7E,$60
	.db	$F0,$00,$0F,$07,$FF,$E0, $F8,$00,$1F,$01,$FF,$80
	.db	$FE,$00,$7F,$00,$7E,$00, $FF,$01,$FF,$00,$3C,$00
	.db	$FF,$01,$FF,$00,$34,$00, $FF,$01,$FF,$00,$78,$00
	.db	$FF,$00,$FF,$00,$54,$00, $FF,$00,$FF,$00,$3A,$00
	.db	$FE,$00,$FF,$00,$54,$00, $FE,$01,$FF,$00,$98,$00
	.db	$FE,$03,$FF,$00,$00,$00, $FF,$01,$FF,$00,$20,$00
	.db	$FF,$01,$FF,$00,$74,$00, $FF,$01,$FF,$00,$28,$00
	.db	$FF,$83,$FF,$00,$10,$00, $FF,$83,$FF,$00,$00,$00
	.db	$FF,$C7,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBrickB1:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$6E,$00 ; 21
	.db	$FC,$00,$3F,$01,$DE,$80, $F0,$00,$0F,$06,$AE,$E0
	.db	$F0,$00,$0F,$05,$46,$E0, $F0,$00,$0F,$02,$98,$E0
	.db	$F0,$00,$0F,$04,$7E,$60, $F0,$00,$0F,$01,$2F,$80
	.db	$F0,$00,$0F,$07,$5F,$E0, $F0,$00,$0F,$02,$67,$E0
	.db	$F0,$00,$0F,$05,$19,$E0, $F0,$00,$0F,$02,$6E,$60
	.db	$F0,$00,$0F,$01,$DE,$80, $F0,$00,$0F,$06,$AE,$E0
	.db	$F0,$00,$0F,$05,$5E,$E0, $F0,$00,$0F,$02,$BA,$E0
	.db	$F0,$00,$0F,$05,$FE,$E0, $F0,$00,$0F,$03,$F9,$A0
	.db	$F0,$00,$0F,$07,$E7,$E0, $F8,$00,$1F,$01,$9F,$80
	.db	$FE,$00,$7F,$00,$7E,$00, $FF,$81,$FF,$00,$18,$00
	.db	$FF,$E7,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBrickB2:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$6E,$00 ; 22
	.db	$FC,$00,$3F,$01,$DE,$80, $F0,$00,$0F,$06,$AE,$E0
	.db	$F0,$00,$0F,$05,$46,$E0, $F0,$00,$0F,$02,$98,$E0
	.db	$F0,$00,$0F,$04,$7E,$60, $F0,$00,$0F,$01,$2F,$80
	.db	$F8,$00,$0F,$03,$5F,$E0, $F8,$00,$0F,$02,$67,$C0
	.db	$F8,$00,$1F,$01,$19,$C0, $FC,$00,$1F,$00,$6E,$40
	.db	$FC,$00,$1F,$01,$FE,$80, $FC,$00,$1F,$00,$BD,$C0
	.db	$F8,$00,$1F,$01,$5A,$C0, $F8,$00,$1F,$02,$B9,$C0
	.db	$F8,$00,$1F,$01,$FA,$C0, $F8,$00,$1F,$03,$FB,$80
	.db	$F8,$00,$3F,$01,$E7,$00, $FC,$00,$7F,$00,$1F,$00
	.db	$FF,$80,$7F,$00,$3C,$00, $FF,$81,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBrickB3:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$6E,$00 ; 23
	.db	$FC,$00,$3F,$01,$DE,$80, $F0,$00,$0F,$06,$AE,$E0
	.db	$F0,$00,$0F,$05,$46,$E0, $F0,$00,$0F,$02,$98,$E0
	.db	$F0,$00,$0F,$04,$7E,$40, $F0,$00,$1F,$01,$2F,$80
	.db	$F0,$00,$1F,$07,$5F,$C0, $F0,$00,$1F,$02,$67,$00
	.db	$F8,$00,$7F,$01,$19,$00, $FC,$00,$7F,$00,$6E,$00
	.db	$FC,$00,$FF,$01,$DE,$00, $FC,$00,$FF,$00,$AE,$00
	.db	$FE,$00,$FF,$00,$5E,$00, $FE,$00,$FF,$00,$BA,$00
	.db	$FE,$00,$FF,$00,$FE,$00, $FE,$00,$FF,$00,$F8,$00
	.db	$FE,$01,$FF,$00,$E4,$00, $FE,$01,$FF,$00,$98,$00
	.db	$FE,$03,$FF,$00,$78,$00, $FF,$03,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprBrickB4:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$6E,$00 ; 24
	.db	$FC,$00,$3F,$01,$DE,$80, $F0,$00,$0F,$06,$AC,$E0
	.db	$F0,$00,$0F,$05,$43,$E0, $F0,$00,$0F,$03,$98,$C0
	.db	$F8,$00,$1F,$01,$3C,$00, $FC,$00,$3F,$01,$AF,$80
	.db	$FC,$00,$3F,$00,$5C,$00, $FF,$00,$7F,$00,$27,$00
	.db	$FF,$00,$7F,$00,$09,$00, $FF,$00,$7F,$00,$66,$00
	.db	$FF,$00,$FF,$00,$54,$00, $FF,$00,$FF,$00,$2C,$00
	.db	$FF,$00,$FF,$00,$5E,$00, $FF,$00,$FF,$00,$3A,$00
	.db	$FF,$00,$FF,$00,$7E,$00, $FF,$00,$FF,$00,$78,$00
	.db	$FF,$00,$FF,$00,$26,$00, $FF,$80,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprCyclopS:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$00,$FF,$00,$7E,$00 ; 25
	.db	$FC,$00,$3F,$01,$FF,$80, $F8,$00,$1F,$02,$FF,$C0
	.db	$F0,$00,$0F,$05,$7F,$E0, $F0,$00,$0F,$02,$BF,$E0
	.db	$F8,$00,$0F,$01,$5F,$C0, $FC,$00,$1F,$00,$9F,$00
	.db	$FE,$00,$7F,$00,$5E,$00, $FF,$00,$FF,$00,$18,$00
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$18,$00
	.db	$FF,$C0,$FF,$00,$18,$00, $FF,$80,$7F,$00,$1E,$00
	.db	$FF,$00,$7F,$00,$31,$00, $FE,$00,$3F,$00,$65,$00
	.db	$FE,$00,$3F,$00,$E6,$80, $FE,$00,$3F,$00,$F0,$80
	.db	$FE,$00,$3F,$00,$7C,$80, $FF,$00,$3F,$00,$1F,$00
	.db	$FF,$C0,$7F,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprCyclopW:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$00,$FF,$00,$7E,$00 ; 26
	.db	$FC,$00,$3F,$01,$FF,$80, $F8,$00,$1F,$02,$FF,$C0
	.db	$F0,$00,$0F,$05,$7F,$E0, $F0,$00,$0F,$02,$BF,$E0
	.db	$F8,$00,$0F,$01,$5F,$C0, $FC,$00,$1F,$00,$9F,$00
	.db	$FE,$00,$7F,$00,$5E,$00, $FF,$00,$FF,$00,$18,$00
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$18,$00
	.db	$FF,$03,$FF,$00,$18,$00, $FE,$01,$FF,$00,$78,$00
	.db	$FE,$00,$FF,$00,$8C,$00, $FC,$00,$7F,$00,$A6,$00
	.db	$FC,$00,$7F,$01,$67,$00, $FC,$00,$7F,$01,$0F,$00
	.db	$FC,$00,$7F,$01,$3E,$00, $FC,$00,$FF,$00,$F8,$00
	.db	$FE,$03,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprCyclopN:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$00,$FF,$00,$7E,$00 ; 27
	.db	$FC,$00,$3F,$01,$FF,$80, $F8,$00,$1F,$02,$FF,$C0
	.db	$F0,$00,$0F,$05,$7F,$E0, $F0,$00,$0F,$02,$BF,$E0
	.db	$F8,$00,$0F,$01,$5F,$C0, $FC,$00,$1F,$00,$9F,$00
	.db	$FE,$00,$7F,$00,$5E,$00, $FF,$00,$FF,$00,$18,$00
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$18,$00
	.db	$FF,$03,$FF,$00,$18,$00, $FE,$00,$FF,$00,$78,$00
	.db	$FE,$00,$7F,$00,$FE,$00, $FC,$00,$7F,$00,$FF,$00
	.db	$FC,$00,$7F,$01,$FF,$00, $FC,$00,$7F,$01,$FE,$00
	.db	$FC,$00,$FF,$01,$FC,$00, $FC,$01,$FF,$00,$F8,$00
	.db	$FE,$03,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprCyclopE:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$00,$FF,$00,$7E,$00 ; 28
	.db	$FC,$00,$3F,$01,$FF,$80, $F8,$00,$1F,$02,$FF,$C0
	.db	$F0,$00,$0F,$05,$7F,$E0, $F0,$00,$0F,$02,$BF,$E0
	.db	$F8,$00,$0F,$01,$5F,$C0, $FC,$00,$1F,$00,$9F,$00
	.db	$FE,$00,$7F,$00,$5E,$00, $FF,$00,$FF,$00,$18,$00
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$18,$00
	.db	$FF,$C0,$FF,$00,$18,$00, $FF,$00,$7F,$00,$1E,$00
	.db	$FE,$00,$7F,$00,$7F,$00, $FE,$00,$3F,$00,$FF,$00
	.db	$FE,$00,$3F,$00,$FF,$80, $FE,$00,$3F,$00,$7F,$80
	.db	$FF,$00,$3F,$00,$3F,$80, $FF,$80,$3F,$00,$1F,$00
	.db	$FF,$C0,$7F,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprEyeS:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$25,$40 ; 29
	.db	$FF,$FF,$FF,$00,$4A,$A0, $FF,$FF,$FF,$01,$05,$40
	.db	$FF,$FF,$FF,$02,$A0,$00, $FF,$FF,$FF,$05,$54,$00
	.db	$FF,$FF,$FF,$02,$A8,$00, $FF,$F0,$3F,$00,$00,$00
	.db	$FF,$C0,$1F,$00,$07,$80, $FE,$00,$1F,$00,$1F,$C0
	.db	$F8,$00,$0F,$00,$FF,$C0, $F0,$00,$0F,$03,$3F,$E0
	.db	$F0,$00,$0F,$04,$1F,$E0, $F0,$40,$0F,$02,$0F,$E0
	.db	$F8,$60,$0F,$01,$07,$C0, $F0,$00,$1F,$02,$00,$00
	.db	$F0,$03,$FF,$04,$F0,$00, $F0,$03,$FF,$05,$88,$00
	.db	$F0,$01,$FF,$03,$28,$00, $F0,$01,$FF,$07,$34,$00
	.db	$F0,$01,$FF,$07,$84,$00, $F0,$01,$FF,$03,$E4,$00
	.db	$F8,$01,$FF,$00,$F8,$00, $FE,$03,$FF,$00,$00,$00
SprEyeW:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$AA,$00 ; 30
	.db	$FF,$FF,$FF,$01,$55,$00, $FF,$FF,$FF,$00,$AA,$00
	.db	$FF,$FF,$FF,$00,$40,$80, $FF,$FF,$FF,$02,$AA,$00
	.db	$FF,$FF,$FF,$01,$54,$00, $FE,$0F,$FF,$00,$00,$00
	.db	$FC,$01,$FF,$00,$F0,$00, $FC,$00,$1F,$01,$FC,$00
	.db	$F8,$00,$0F,$01,$FF,$C0, $F8,$00,$0F,$03,$FE,$20
	.db	$F8,$00,$0F,$03,$FC,$20, $F8,$00,$0F,$03,$F8,$40
	.db	$F8,$00,$1F,$01,$F1,$80, $FC,$00,$3F,$00,$02,$00
	.db	$F8,$00,$7F,$01,$E2,$00, $F8,$00,$3F,$02,$31,$00
	.db	$F0,$00,$3F,$02,$98,$80, $F0,$00,$3F,$05,$9F,$00
	.db	$F0,$00,$7F,$04,$3C,$00, $F0,$01,$FF,$04,$F8,$00
	.db	$F0,$03,$FF,$03,$E0,$00, $F8,$0F,$FF,$00,$00,$00
SprEyeN:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$02,$A8,$00 ; 31
	.db	$FF,$FF,$FF,$01,$55,$00, $FF,$FF,$FF,$02,$A8,$80
	.db	$FF,$FF,$FF,$00,$00,$40, $FF,$FF,$FF,$00,$AA,$80
	.db	$FF,$FF,$FF,$00,$55,$40, $FC,$0F,$FF,$00,$00,$00
	.db	$F8,$07,$FF,$01,$E0,$00, $F8,$00,$7F,$02,$30,$00
	.db	$F0,$00,$3F,$02,$99,$00, $F0,$00,$3F,$05,$9E,$80
	.db	$F0,$00,$3F,$04,$3C,$80, $F0,$00,$1F,$04,$F8,$80
	.db	$F0,$02,$1F,$03,$E0,$40, $F8,$01,$0F,$00,$00,$40
	.db	$FF,$00,$0F,$00,$3C,$20, $FF,$00,$0F,$00,$7F,$20
	.db	$FE,$00,$0F,$00,$7F,$C0, $FE,$00,$1F,$00,$FF,$80
	.db	$FE,$00,$3F,$00,$FF,$00, $FE,$00,$7F,$00,$FE,$00
	.db	$FE,$00,$FF,$00,$7C,$00, $FF,$01,$FF,$00,$00,$00
SprEyeE:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$01,$54,$00 ; 32
	.db	$FF,$FF,$FF,$02,$AA,$00, $FF,$FF,$FF,$01,$54,$00
	.db	$FF,$FF,$FF,$02,$00,$00, $FF,$FF,$FF,$01,$55,$40
	.db	$FF,$FF,$FF,$00,$0A,$A0, $FE,$07,$FF,$00,$00,$00
	.db	$FC,$03,$FF,$00,$F0,$00, $F8,$03,$FF,$01,$88,$00
	.db	$F0,$01,$FF,$03,$28,$00, $F0,$01,$FF,$07,$34,$00
	.db	$F0,$01,$FF,$07,$84,$00, $F0,$01,$FF,$03,$E4,$00
	.db	$F0,$01,$FF,$04,$F8,$00, $F0,$00,$3F,$04,$00,$00
	.db	$F0,$40,$1F,$04,$07,$80, $F0,$00,$1F,$03,$1F,$C0
	.db	$F8,$00,$0F,$00,$FF,$C0, $FE,$00,$0F,$00,$3F,$E0
	.db	$FF,$80,$0F,$00,$1F,$E0, $FF,$C0,$0F,$00,$0F,$E0
	.db	$FF,$E0,$0F,$00,$07,$C0, $FF,$F0,$1F,$00,$00,$00
SprFrog1:
	.db	$FF,$FF,$FF,$00,$00,$00, $FC,$00,$FF,$01,$AA,$00 ; 33
	.db	$F8,$00,$0F,$01,$FF,$40, $F0,$00,$0F,$02,$FF,$E0
	.db	$F0,$00,$0F,$05,$7F,$C0, $F0,$00,$0F,$02,$FF,$E0
	.db	$F8,$00,$0F,$01,$7F,$80, $FC,$00,$3F,$00,$BF,$00
	.db	$FE,$00,$7F,$00,$47,$00, $FE,$00,$7F,$00,$3E,$00
	.db	$FC,$00,$3F,$00,$FF,$00, $F8,$00,$1F,$01,$F8,$80
	.db	$F0,$00,$1F,$02,$70,$40, $F0,$00,$0F,$04,$00,$40
	.db	$F0,$00,$0F,$00,$00,$20, $F0,$00,$0F,$04,$00,$20
	.db	$F0,$00,$0F,$04,$00,$00, $F0,$00,$0F,$04,$00,$00
	.db	$F0,$00,$0F,$02,$00,$20, $F8,$00,$0F,$03,$07,$40
	.db	$F8,$00,$1F,$01,$8F,$80, $FC,$00,$3F,$00,$FF,$00
	.db	$FE,$00,$7F,$00,$3C,$00, $FF,$81,$FF,$00,$00,$00
SprFrog2:
	.db	$FF,$FF,$FF,$00,$00,$00, $FE,$18,$7F,$00,$C3,$00 ; 34
	.db	$FC,$00,$1F,$01,$EF,$C0, $F8,$00,$0F,$03,$FF,$80
	.db	$F0,$00,$0F,$05,$FF,$C0, $F0,$00,$0F,$02,$FF,$E0
	.db	$F8,$00,$0F,$01,$47,$E0, $FC,$00,$0F,$00,$3F,$C0
	.db	$FC,$00,$1F,$00,$FF,$00, $F8,$00,$1F,$01,$F8,$80
	.db	$F8,$00,$1F,$02,$70,$40, $F0,$00,$0F,$00,$00,$40
	.db	$F0,$00,$0F,$04,$00,$20, $F0,$00,$0F,$06,$00,$00
	.db	$F0,$00,$0F,$07,$07,$20, $F0,$00,$0F,$03,$8F,$C0
	.db	$F8,$00,$1F,$03,$FF,$80, $F8,$00,$3F,$01,$FF,$80
	.db	$FC,$00,$3F,$00,$FF,$00, $FE,$00,$7F,$00,$3C,$00
	.db	$FF,$81,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprFrog3:
	.db	$FF,$FF,$FF,$00,$00,$00, $F8,$07,$FF,$03,$70,$00 ; 35
	.db	$F8,$00,$FF,$07,$FE,$00, $F0,$00,$1F,$03,$FF,$80
	.db	$F0,$00,$0F,$05,$C7,$E0, $F0,$00,$0F,$03,$3F,$C0
	.db	$F8,$00,$1F,$00,$FF,$C0, $F8,$00,$1F,$01,$F8,$80
	.db	$F0,$00,$1F,$02,$70,$40, $F0,$00,$0F,$04,$00,$40
	.db	$F0,$00,$0F,$04,$00,$20, $F0,$00,$0F,$07,$07,$20
	.db	$F0,$00,$0F,$07,$8F,$C0, $F0,$00,$1F,$03,$FF,$C0
	.db	$F8,$00,$1F,$03,$FF,$80, $F8,$00,$3F,$01,$FF,$80
	.db	$FC,$00,$3F,$00,$FF,$00, $FE,$00,$7F,$00,$3C,$00
	.db	$FF,$81,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprFrog4:
	.db	$FF,$FF,$FF,$00,$00,$00, $FE,$03,$FF,$00,$D8,$00 ; 36
	.db	$FC,$00,$FF,$01,$FE,$00, $F8,$00,$3F,$02,$FF,$00
	.db	$F0,$00,$0F,$05,$7E,$C0, $F0,$00,$0F,$02,$BF,$E0
	.db	$F8,$00,$0F,$01,$47,$C0, $FC,$00,$1F,$00,$3F,$80
	.db	$FC,$00,$3F,$00,$FF,$00, $F8,$00,$1F,$01,$FF,$80
	.db	$F8,$00,$1F,$03,$FF,$C0, $F0,$00,$0F,$00,$F8,$C0
	.db	$F0,$00,$0F,$07,$77,$60, $F0,$00,$0F,$07,$8F,$A0
	.db	$F0,$00,$0F,$03,$FF,$C0, $F8,$00,$1F,$03,$FF,$C0
	.db	$F8,$00,$1F,$01,$FF,$80, $FC,$00,$3F,$00,$FF,$00
	.db	$FE,$00,$7F,$00,$3C,$00, $FF,$81,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprStar1:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$02,$14,$20 ; 37
	.db	$FF,$FF,$FF,$00,$AA,$80, $FF,$FF,$FF,$00,$14,$00
	.db	$FF,$FF,$FF,$00,$80,$80, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$E3,$FF,$00,$00,$00
	.db	$FF,$E3,$FF,$00,$08,$00, $FF,$E3,$FF,$00,$08,$00
	.db	$F8,$63,$8F,$00,$08,$00, $F8,$00,$0F,$03,$00,$20
	.db	$F8,$00,$0F,$00,$DC,$C0, $FE,$00,$1F,$00,$1F,$00
	.db	$FF,$80,$7F,$00,$3E,$00, $FE,$00,$1F,$00,$3F,$00
	.db	$F8,$00,$0F,$00,$DC,$C0, $F8,$00,$0F,$03,$08,$20
	.db	$F8,$63,$8F,$00,$08,$00, $FF,$E3,$FF,$00,$08,$00
	.db	$FF,$E3,$FF,$00,$08,$00, $FF,$E3,$FF,$00,$00,$00
SprStar2:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$01,$14,$40 ; 38
	.db	$FF,$FF,$FF,$00,$2A,$00, $FF,$FF,$FF,$00,$14,$00
	.db	$FF,$FF,$FF,$00,$41,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$E3,$FF,$00,$00,$00
	.db	$FF,$E3,$FF,$00,$08,$00, $FF,$E3,$FF,$00,$08,$00
	.db	$F8,$41,$8F,$00,$00,$00, $F8,$00,$0F,$03,$1C,$20
	.db	$F8,$00,$0F,$00,$3E,$C0, $FF,$00,$1F,$00,$7E,$00
	.db	$FF,$00,$7F,$00,$7F,$00, $FE,$00,$1F,$00,$7F,$00
	.db	$F8,$00,$0F,$00,$BE,$C0, $F8,$00,$0F,$03,$0C,$20
	.db	$F8,$61,$8F,$00,$08,$00, $FF,$E3,$FF,$00,$08,$00
	.db	$FF,$E3,$FF,$00,$08,$00, $FF,$E3,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprStar3:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$15,$00 ; 39
	.db	$FF,$FF,$FF,$00,$AA,$80, $FF,$FF,$FF,$00,$54,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$E3,$FF,$00,$00,$00
	.db	$FF,$E3,$FF,$00,$08,$00, $FF,$C1,$FF,$00,$00,$00
	.db	$F8,$00,$0F,$00,$1C,$00, $F8,$00,$0F,$03,$7F,$20
	.db	$F8,$00,$0F,$00,$7F,$40, $FE,$00,$1F,$00,$FF,$80
	.db	$FE,$00,$3F,$00,$FF,$80, $FE,$00,$1F,$00,$FF,$80
	.db	$F8,$00,$0F,$00,$FF,$C0, $F8,$00,$0F,$03,$6F,$20
	.db	$F8,$00,$0F,$00,$0C,$00, $FF,$E1,$FF,$00,$08,$00
	.db	$FF,$E3,$FF,$00,$08,$00, $FF,$E3,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprStar4:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$15,$40 ; 40
	.db	$FF,$FF,$FF,$00,$AA,$80, $FF,$FF,$FF,$01,$54,$00
	.db	$FF,$C1,$FF,$00,$00,$00, $FF,$00,$7F,$00,$1C,$00
	.db	$F8,$00,$0F,$00,$7F,$00, $F8,$00,$0F,$02,$FF,$A0
	.db	$F8,$00,$0F,$00,$7F,$00, $FC,$00,$1F,$01,$FF,$C0
	.db	$FC,$00,$1F,$01,$FF,$C0, $FC,$00,$1F,$01,$FF,$C0
	.db	$F8,$00,$0F,$00,$FF,$C0, $F8,$00,$0F,$03,$FF,$A0
	.db	$F8,$00,$0F,$00,$6F,$00, $FF,$00,$7F,$00,$0C,$00
	.db	$FF,$E1,$FF,$00,$08,$00, $FF,$E3,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprLasShot1:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00 ; 41
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FC,$7F,$FF,$00,$00,$00, $FC,$0F,$FF,$00,$00,$00
	.db	$F0,$07,$FF,$01,$00,$00, $F0,$03,$FF,$00,$60,$00
	.db	$F0,$00,$7F,$0F,$10,$00, $F0,$00,$3F,$07,$E0,$00
	.db	$F0,$00,$1F,$0B,$E6,$00, $F0,$00,$1F,$03,$FB,$80
	.db	$F0,$00,$0F,$00,$FE,$00, $F8,$00,$0F,$00,$1F,$D0
	.db	$FC,$00,$0F,$00,$27,$C0, $FE,$00,$0F,$00,$17,$F0
	.db	$FF,$C0,$0F,$00,$01,$F0, $FF,$E0,$0F,$00,$01,$00
	.db	$FF,$F4,$1F,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprLasShot2:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00 ; 42
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FE,$3F,$FF,$00,$00,$00
	.db	$F8,$1F,$FF,$00,$00,$00, $F0,$03,$FF,$00,$80,$00
	.db	$F0,$01,$FF,$0E,$40,$00, $F0,$00,$7F,$0F,$80,$00
	.db	$F0,$00,$3F,$03,$F8,$00, $F0,$00,$1F,$00,$FD,$00
	.db	$F0,$00,$0F,$02,$FE,$00, $F8,$00,$0F,$00,$1F,$A0
	.db	$FC,$00,$0F,$00,$07,$C0, $FF,$80,$0F,$00,$00,$F0
	.db	$FF,$C0,$0F,$00,$01,$30, $FF,$F8,$0F,$00,$00,$00
	.db	$FF,$FC,$1F,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprShot1:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00 ; 43
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FB,$FF,$00,$00,$00
	.db	$FC,$E1,$FF,$00,$04,$00, $F8,$03,$3F,$03,$18,$00
	.db	$FC,$00,$1F,$00,$C8,$C0, $FF,$00,$3F,$00,$3D,$00
	.db	$FA,$00,$3F,$00,$F6,$00, $F0,$00,$1F,$05,$2B,$40
	.db	$F8,$00,$0F,$02,$7E,$A0, $FC,$00,$1F,$00,$94,$00
	.db	$F8,$00,$3F,$03,$33,$80, $FC,$00,$1F,$00,$08,$40
	.db	$FF,$87,$BF,$00,$30,$00, $FF,$CF,$FF,$00,$00,$00
SprShot2:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00 ; 44
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$DD,$FF,$00,$00,$00
	.db	$FE,$88,$FF,$00,$22,$00, $FC,$00,$FF,$01,$52,$00
	.db	$FE,$00,$FF,$00,$BC,$00, $FE,$00,$7F,$00,$7D,$00
	.db	$FC,$00,$FF,$01,$FE,$00, $FE,$01,$FF,$00,$3C,$00
	.db	$FF,$03,$FF,$00,$68,$00, $FE,$11,$FF,$00,$84,$00
	.db	$FF,$7B,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprLasertron1:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$6E,$00 ; 45
	.db	$FC,$00,$3F,$01,$8F,$80, $F0,$00,$0F,$06,$1F,$E0
	.db	$F0,$00,$0F,$04,$63,$E0, $F0,$00,$0F,$05,$85,$60
	.db	$F0,$00,$0F,$06,$0A,$A0, $F0,$00,$0F,$02,$05,$40
	.db	$F8,$00,$1F,$01,$0A,$80, $FC,$00,$3F,$00,$85,$00
	.db	$FE,$00,$7F,$00,$4A,$00, $FF,$00,$FF,$00,$24,$00
	.db	$FF,$81,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprLasertron2:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$6E,$00 ; 46
	.db	$FC,$00,$3F,$01,$8F,$80, $F0,$00,$0F,$06,$1F,$E0
	.db	$F0,$00,$0F,$04,$67,$E0, $F0,$00,$0F,$05,$81,$E0
	.db	$F0,$00,$0F,$06,$18,$60, $F0,$00,$0F,$04,$66,$20
	.db	$F0,$00,$0F,$01,$85,$80, $F0,$00,$0F,$06,$0A,$E0
	.db	$F0,$00,$0F,$02,$05,$40, $F8,$00,$1F,$01,$0A,$80
	.db	$FC,$00,$3F,$00,$85,$00, $FE,$00,$7F,$00,$4A,$00
	.db	$FF,$00,$FF,$00,$24,$00, $FF,$81,$FF,$00,$18,$00
	.db	$FF,$C3,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprLasertron3:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$6E,$00 ; 47
	.db	$FC,$00,$3F,$01,$8F,$80, $F0,$00,$0F,$06,$1F,$E0
	.db	$F0,$00,$0F,$04,$67,$E0, $F0,$00,$0F,$05,$81,$E0
	.db	$F0,$00,$0F,$06,$3C,$60, $F0,$00,$0F,$04,$7E,$20
	.db	$F0,$00,$0F,$03,$66,$C0, $F8,$00,$1F,$00,$99,$00
	.db	$FC,$00,$3F,$00,$66,$00, $F0,$00,$0F,$01,$85,$80
	.db	$F0,$00,$0F,$06,$0A,$E0, $F0,$00,$0F,$02,$05,$40
	.db	$F8,$00,$1F,$01,$0A,$80, $FC,$00,$3F,$00,$85,$00
	.db	$FE,$00,$7F,$00,$4A,$00, $FF,$00,$FF,$00,$24,$00
	.db	$FF,$81,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprLasertron4:
	.db	$FF,$C3,$FF,$00,$18,$00, $FF,$00,$FF,$00,$6E,$00 ; 48
	.db	$FC,$00,$3F,$01,$8F,$80, $F0,$00,$0F,$06,$1F,$E0
	.db	$F0,$00,$0F,$04,$67,$E0, $F0,$00,$0F,$05,$81,$E0
	.db	$F0,$00,$0F,$06,$3C,$60, $F0,$00,$0F,$04,$7E,$20
	.db	$F0,$00,$0F,$02,$FF,$40, $F8,$00,$1F,$01,$FF,$80
	.db	$FC,$00,$3F,$01,$FF,$80, $FC,$00,$3F,$01,$E7,$80
	.db	$FC,$00,$3F,$00,$99,$00, $FC,$00,$3F,$00,$66,$00
	.db	$F0,$00,$0F,$01,$85,$80, $F0,$00,$0F,$06,$0A,$E0
	.db	$F0,$00,$0F,$02,$05,$40, $F8,$00,$1F,$01,$0A,$80
	.db	$FC,$00,$3F,$00,$85,$00, $FE,$00,$7F,$00,$4A,$00
	.db	$FF,$00,$FF,$00,$24,$00, $FF,$81,$FF,$00,$18,$00
	.db	$FF,$C3,$FF,$00,$00,$00, $FF,$FF,$FF,$00,$00,$00
SprVortonE:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$00,$FF,$00,$7E,$00 ; 49
	.db	$FE,$00,$7F,$00,$81,$00, $F8,$00,$3F,$02,$7E,$80
	.db	$F0,$00,$1F,$04,$81,$C0, $F0,$00,$1F,$02,$7E,$C0
	.db	$F0,$00,$1F,$04,$81,$C0, $F0,$00,$1F,$02,$7E,$80
	.db	$F0,$00,$3F,$04,$81,$80, $F0,$00,$3F,$02,$7E,$80
	.db	$F0,$00,$3F,$04,$81,$00, $F0,$00,$7F,$02,$7E,$00
	.db	$F0,$00,$7F,$04,$FF,$00, $F0,$00,$7F,$03,$C3,$00
	.db	$F0,$00,$7F,$07,$00,$00, $F0,$00,$3F,$06,$7E,$00
	.db	$F0,$00,$1F,$01,$FF,$80, $F8,$00,$1F,$03,$FF,$C0
	.db	$F8,$00,$1F,$03,$FF,$C0, $F8,$00,$1F,$01,$FF,$80
	.db	$FC,$00,$3F,$00,$FF,$00, $FE,$00,$7F,$00,$7E,$00
	.db	$FF,$00,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$00,$00
SprVortonSE:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$01,$FF,$00,$7C,$00 ; 50
	.db	$FC,$00,$7F,$01,$87,$00, $F8,$00,$1F,$02,$7F,$C0
	.db	$F0,$00,$0F,$05,$87,$E0, $F0,$00,$0F,$02,$7F,$E0
	.db	$F0,$00,$0F,$05,$87,$C0, $F0,$00,$1F,$02,$7F,$C0
	.db	$F0,$00,$1F,$05,$87,$C0, $F0,$00,$1F,$02,$7F,$80
	.db	$F0,$00,$3F,$05,$87,$80, $F0,$00,$3F,$02,$7F,$80
	.db	$F0,$00,$3F,$05,$FB,$00, $F0,$00,$7F,$03,$C3,$00
	.db	$F0,$00,$7F,$07,$00,$00, $F0,$00,$3F,$04,$7E,$00
	.db	$F0,$00,$1F,$05,$FF,$80, $F0,$00,$1F,$03,$FF,$C0
	.db	$F8,$00,$1F,$03,$FF,$40, $F8,$00,$1F,$01,$FF,$00
	.db	$FC,$00,$7F,$00,$FF,$00, $FE,$00,$7F,$00,$7E,$00
	.db	$FF,$00,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$00,$00
SprVortonS:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$00,$7F,$00,$7F,$00 ; 51
	.db	$FC,$00,$1F,$01,$FF,$80, $F8,$00,$0F,$02,$FF,$A0
	.db	$F0,$00,$0F,$05,$7F,$A0, $F0,$00,$0F,$02,$FF,$40
	.db	$F0,$00,$1F,$05,$7F,$40, $F0,$00,$1F,$02,$7F,$40
	.db	$F0,$00,$1F,$05,$BE,$80, $F0,$00,$1F,$02,$7E,$C0
	.db	$F0,$00,$1F,$05,$9E,$80, $F0,$00,$1F,$02,$7D,$C0
	.db	$F0,$00,$1F,$05,$9D,$00, $F0,$00,$1F,$03,$E1,$C0
	.db	$F0,$00,$1F,$07,$00,$80, $F0,$00,$1F,$04,$7F,$40
	.db	$F0,$00,$1F,$05,$FC,$80, $F0,$00,$1F,$03,$FD,$40
	.db	$F8,$00,$1F,$03,$FE,$40, $F8,$00,$1F,$01,$FF,$80
	.db	$FC,$00,$3F,$00,$FF,$00, $FE,$00,$7F,$00,$7E,$00
	.db	$FF,$00,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$00,$00
SprVortonSW:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$00,$FF,$00,$66,$00 ; 52
	.db	$FC,$00,$3F,$01,$E7,$80, $F8,$00,$1F,$03,$F7,$C0
	.db	$F0,$00,$0F,$07,$EF,$E0, $F0,$00,$0F,$07,$F7,$E0
	.db	$F0,$00,$0F,$07,$EF,$E0, $F0,$00,$0F,$03,$F7,$C0
	.db	$F0,$00,$0F,$07,$EF,$E0, $F0,$00,$0F,$01,$F7,$80
	.db	$F0,$00,$0F,$07,$EF,$E0, $F0,$00,$0F,$00,$F7,$00
	.db	$F0,$00,$0F,$07,$EF,$E0, $F0,$00,$0F,$00,$43,$00
	.db	$F0,$00,$0F,$07,$24,$E0, $F0,$00,$0F,$04,$5A,$20
	.db	$F0,$00,$0F,$05,$E7,$A0, $F0,$00,$0F,$03,$FF,$C0
	.db	$F8,$00,$1F,$03,$FF,$C0, $F8,$00,$1F,$01,$FF,$80
	.db	$FC,$00,$3F,$00,$FF,$00, $FE,$00,$7F,$00,$7E,$00
	.db	$FF,$00,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$00,$00
SprVortonW:
	.db	$FF,$FF,$FF,$00,$00,$00, $FE,$00,$FF,$00,$FE,$00 ; 53
	.db	$F8,$00,$3F,$01,$FF,$80, $F0,$00,$1F,$05,$FF,$40
	.db	$F0,$00,$0F,$05,$FE,$A0, $F0,$00,$0F,$02,$FF,$40
	.db	$F8,$00,$0F,$02,$FE,$A0, $F8,$00,$0F,$02,$FE,$40
	.db	$F8,$00,$0F,$01,$7D,$A0, $F8,$00,$0F,$03,$7E,$40
	.db	$F8,$00,$0F,$01,$79,$A0, $F8,$00,$0F,$03,$BE,$40
	.db	$F8,$00,$0F,$00,$B9,$A0, $F8,$00,$0F,$03,$87,$C0
	.db	$F8,$00,$0F,$01,$00,$E0, $F8,$00,$0F,$02,$FE,$20
	.db	$F8,$00,$0F,$01,$3F,$A0, $F8,$00,$0F,$02,$BF,$C0
	.db	$F8,$00,$1F,$02,$7F,$C0, $F8,$00,$1F,$01,$FF,$80
	.db	$FC,$00,$3F,$00,$FF,$00, $FE,$00,$7F,$00,$7E,$00
	.db	$FF,$00,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$00,$00
SprVortonNW:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$80,$FF,$00,$3E,$00 ; 54
	.db	$FE,$00,$3F,$00,$E1,$80, $F8,$00,$1F,$03,$FE,$40
	.db	$F0,$00,$0F,$07,$E1,$A0, $F0,$00,$0F,$07,$FE,$40
	.db	$F0,$00,$0F,$03,$E1,$A0, $F8,$00,$0F,$03,$FE,$40
	.db	$F8,$00,$0F,$03,$E1,$A0, $F8,$00,$0F,$01,$FE,$40
	.db	$FC,$00,$0F,$01,$E1,$A0, $FC,$00,$0F,$01,$FE,$40
	.db	$FC,$00,$0F,$00,$DF,$A0, $FE,$00,$0F,$00,$C3,$C0
	.db	$FE,$00,$0F,$00,$00,$E0, $FC,$00,$0F,$00,$7E,$20
	.db	$F8,$00,$0F,$01,$FF,$A0, $F8,$00,$0F,$03,$FF,$C0
	.db	$F8,$00,$1F,$02,$FF,$C0, $F8,$00,$1F,$00,$FF,$80
	.db	$FE,$00,$3F,$00,$FF,$00, $FE,$00,$7F,$00,$7E,$00
	.db	$FF,$00,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$00,$00
SprVortonN:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$00,$FF,$00,$7E,$00 ; 55
	.db	$FE,$00,$7F,$00,$81,$00, $FC,$00,$1F,$01,$7E,$40
	.db	$F8,$00,$0F,$03,$81,$20, $F8,$00,$0F,$03,$7E,$40
	.db	$F8,$00,$0F,$03,$81,$20, $F8,$00,$0F,$01,$7E,$40
	.db	$FC,$00,$0F,$01,$81,$20, $FC,$00,$0F,$01,$7E,$40
	.db	$FC,$00,$0F,$00,$81,$20, $FE,$00,$0F,$00,$7E,$40
	.db	$FE,$00,$0F,$00,$FF,$20, $FE,$00,$0F,$00,$C3,$C0
	.db	$FE,$00,$0F,$00,$00,$E0, $FC,$00,$0F,$00,$7E,$60
	.db	$F8,$00,$0F,$01,$FF,$80, $F8,$00,$1F,$03,$FF,$C0
	.db	$F8,$00,$1F,$03,$FF,$C0, $F8,$00,$1F,$01,$FF,$80
	.db	$FC,$00,$3F,$00,$FF,$00, $FE,$00,$7F,$00,$7E,$00
	.db	$FF,$00,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$00,$00
SprVortonNE:
	.db	$FF,$FF,$FF,$00,$00,$00, $FF,$00,$FF,$00,$6E,$00 ; 56
	.db	$FC,$00,$3F,$01,$89,$80, $F8,$00,$1F,$02,$6E,$40
	.db	$F0,$00,$0F,$05,$89,$A0, $F0,$00,$0F,$02,$6E,$40
	.db	$F0,$00,$0F,$05,$89,$A0, $F0,$00,$0F,$02,$6E,$40
	.db	$F0,$00,$0F,$05,$89,$A0, $F0,$00,$0F,$02,$6E,$40
	.db	$F0,$00,$0F,$05,$89,$A0, $F0,$00,$0F,$02,$6E,$40
	.db	$F0,$00,$0F,$05,$FF,$A0, $F0,$00,$0F,$03,$C3,$C0
	.db	$F0,$00,$0F,$07,$00,$E0, $F0,$00,$0F,$04,$7E,$20
	.db	$F0,$00,$0F,$01,$FF,$80, $F8,$00,$1F,$03,$FF,$C0
	.db	$F8,$00,$1F,$03,$FF,$C0, $F8,$00,$1F,$01,$FF,$80
	.db	$FC,$00,$3F,$00,$FF,$00, $FE,$00,$7F,$00,$7E,$00
	.db	$FF,$00,$FF,$00,$18,$00, $FF,$C3,$FF,$00,$00,$00
SpritesLen	.equ	$-Sprites

;------------------------------------------------------------------------------
; 4 maskovane sprity - 18x24 bodov (3 zn. stlpce) pre animaciu v menu
; 3x24x2 = 144 bytov na sprite
; 4x144 = 576 bytov celkom
; organizacia spritu - 3 byty masky, 3 byty predlohy atd.
SpritesMenu:	;binclude "../data/sprites-menu.bin"

SprBrickX4	.equ	SprBrickM	;SpritesMenu+(0*144)
SprBrickX2	.equ	SprBrickA3	;SpritesMenu+(1*144)
SprBrickX3	.equ	SprBrickA2	;SpritesMenu+(2*144)
SprBrickX1	.equ	SprBlast6	;SpritesMenu+(3*144)

;------------------------------------------------------------------------------
